{
  "021877168792842341310": {
    "description": "We are seeking skilled engineers to join our team in developing a cutting-edge service utilizing AI Agents powered by Large Language Models (LLMs). This project involves designing, implementing, and optimizing AI-driven solutions to enhance user experience and efficiency. Ideal candidates should have a strong understanding of AI technologies and experience in LLMs. If you are passionate about innovation and eager to work with advanced AI solutions, we would love to hear from you!",
    "duration": "1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Agent Development with LLMs",
    "client_infomation": "Member since Jan 9, 2025 Japan 10:51 AM Finance & Accounting Small company (2-9 people)",
    "rate": "$3.00 - $40.00",
    "url": "https://www.upwork.com/jobs/span-class-highlight-span-span-class-highlight-Agent-span-span-class-highlight-Development-span-with-LLMs_~021877168792842341310/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877168792842341310/apply/",
    "upwork_id": "021877168792842341310",
    "job_id": "021877168792842341310",
    "score": 9.0
  },
  "021877164623373019988": {
    "description": "StudyTaco is a venture-backed EdTech startup revolutionising learning by blending behavioural science, neuroscience, and gamification. Our mission is to transform how students approach complex subjects, turning exam prep into an engaging and effective experience. With a growing user base and two initial games launched, we’re ready to scale and need a talented engineer to join our founding team. The Role We’re seeking a Founding Engineer to take ownership of StudyTaco’s technical vision and architecture. As a key founding team member, you’ll work closely with the two co-founders—focused on product/operations and growth/commercials—to design, build, and scale our gamified learning platform. This is a hands-on role, ideal for someone with a passion for building engaging, interactive products from the ground up. Given our vision of gamifying learning, a background in game development or experience creating engaging, interactive experiences is highly desirable. What You’ll Do - Lead the end-to-end development of StudyTaco’s platform, including backend architecture, front-end interfaces, and AI-driven features. - Integrate gamification and behavioural science into the product to create seamless, engaging user experiences. - Ensure the platform is scalable and robust as we grow our user base. - Collaborate with the co-founders to align technical decisions with business strategy and product goals. - Build and eventually mentor a world-class engineering team as the company grows. What We’re Looking For Technical Skills - Proficiency in full-stack development (e.g., React, Node.js, Python, or similar). - Experience with cloud infrastructure (AWS, GCP, or Azure). - Background in game development or gamification is a strong plus. - Familiarity with AI/ML integration and behavioural science concepts is highly desirable. Mindset - Passion for creating engaging, user-centered products. - Entrepreneurial spirit and a willingness to take ownership. - Thrives in a fast-paced, collaborative startup environment. Experience - 3+ years in software engineering, ideally with experience in startups or consumer-focused products. - Previous experience building or scaling a tech product is a big advantage.",
    "duration": "6+ months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Founding Engineer for Gamified EdTech Platform",
    "client_infomation": "United Kingdom, London 1:52 AM, $14K total spent, 71 hires, 3 active, 1,061 hours, Real Estate, Mid-sized company (10-99 people)",
    "rate": "$45.00 - $100.00",
    "url": "https://www.upwork.com/jobs/Founding-Engineer-for-Gamified-EdTech-Platform_~021877164623373019988/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877164623373019988/apply/",
    "upwork_id": "021877164623373019988",
    "job_id": "021877164623373019988",
    "score": 7.0
  },
  "021877155818941314691": {
    "description": "I have set up a OneNote document for my project. I’ve started collecting\nbackground information from the web or documents people send m…",
    "duration": "Not Applicable",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Convert PDF printouts to searchable text and add to OneNote",
    "client_infomation": "nan",
    "rate": "$20",
    "url": "https://www.upwork.com/jobs/Data-Entry-and-Administrative-Support-with-Canva-Design-Skills_~021877155818941314691/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877155818941314691/apply/",
    "upwork_id": "021877155818941314691",
    "job_id": "021877155818941314691",
    "score": 2.0
  },
  "021877150818072655491": {
    "description": "Hi - I am looking to hire someone to help me troubleshoot a sales campaign that I set up in instantly.ai. I set up a gmail account to…",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Instantly.ai sales campaign set-up and management",
    "client_infomation": "nan",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Automation-span-class-highlight-Developer-span-for-Cold-Lead-Generation-Workflow-with-Apollo-and-CRM-Integration_~021877150818072655491/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877150818072655491/apply/",
    "upwork_id": "021877150818072655491",
    "job_id": "021877150818072655491",
    "score": 3.0
  },
  "021877148463587724222": {
    "description": "I am seeking a developer or automation specialist to build a system that: 1. Parses incoming property leads (via email and/or SMS) to extract relevant information (address, price, units, etc.). 2. Queries RentCast (or a similar rent estimate service) to gather rental data (current rent, rent comps, etc.). 3. Populates a Google Sheet with key data (address, rent estimate, cash-on-cash return, etc.). 4. Handles special logic for multi-unit properties (7+ units) to store or transform data differently. 5. Keeps daily API costs to under $0.50/day. --- 2. Project Goals Automation: Eliminate manual copy-pasting of property addresses, rent estimates, and ROI calculations. Accuracy: Ensure data extracted and rent estimates are consistently accurate. Scalability & Cost Control: Handle a growing number of leads while staying within a $0.50/day API budget. --- 3. Scope and Requirements 3.1. Data Capture & Parsing 1. Sources: The system should capture data from: Email: Some leads arrive via email (with property details or direct links to listings). Text Messages (SMS): Some leads arrive via text, which may be forwarded through services like Twilio or Zapier. 2. Parsing Fields: Address (required for RentCast lookup) Property Purchase Price (if available) Number of Units (important for 7+ unit logic) Any additional fields that might be relevant (e.g., link to the listing, agent’s contact info, etc.). 3. Preferred Tools (flexible): Zapier, Make (Integromat), or a custom solution in Python/Node.js/Google Apps Script. Must ensure reliability and easy maintainability. 3.2. RentCast Integration 1. Retrieve Rent Estimates: Use RentCast’s API (or equivalent) to get current rent, high/low estimates, or average rents for the ZIP code. If the property listing already contains the current rent, incorporate that into the data. 2. API Cost Constraints: The system should not exceed $0.50/day in API usage. Minimize duplicates: Only call RentCast once per unique address. Potentially batch calls or check for repeated addresses. 3.3. Google Sheets Integration 1. Data Columns in Google Sheets should include (but aren’t limited to): Timestamp (date the lead was processed) Address Purchase Price Number of Units Monthly Rent Estimate Other rent comps or relevant data from RentCast Cash-on-Cash Return (see next section) Notes or Status field for manual follow-up. 2. Handling 7+ Units: If Units less than 7, either: Insert data into a separate tab (e.g., “7+ Units” tab), or Encode or summarize the data differently (e.g., partial data, redacted financials). 3.4. Cash-on-Cash Return Calculation 1. Inputs: Purchase Price (from the lead or manually estimated) Rent (from the listing and/or RentCast estimates) Down Payment (might be a standard % or a column in the sheet) Expenses (option to assume a percentage or a fixed amount) Mortgage Payment (if financed; can be estimated or left as a variable input) 2. Formula: Annual Net Cash Flow = (Monthly Rent – Monthly Expenses – Mortgage) × 12 Total Cash Invested = Down Payment + Closing Costs (if applicable) Cash-on-Cash Return % = (Annual Net Cash Flow / Total Cash Invested) × 100 3. Implementation: Can be calculated within Google Sheets (preferred for easier tweaking of assumptions). Alternatively, can be calculated in the automation script. 3.5. Error Handling & Edge Cases 1. Duplicate Addresses: If the same property address is sent multiple times, ensure we do not duplicate RentCast calls unnecessarily. 2. Missing Data: Some leads may be missing purchase price or unit count. The system should log them but still attempt to fill whatever data is available. 3. Notification/Logging: If a lead is processed successfully, optionally send a notification (email or Slack) if it meets a certain ROI threshold (optional). --- 4. Technical Details & Constraints 5. Platform/Hosting: If using a no-code tool (Zapier, Make), you must specify the steps needed. If using a custom script (e.g., Google Apps Script or a serverless function), it must be well-documented for future maintenance. 6. User Authentication: Securely handle the RentCast API key (do not store in plain text in public code repositories). 7. Daily API Budget: Provide a method to track the number of calls to ensure we stay under $0.50/day. Implement caching or a check on previously-seen addresses. 8. Google Sheet Setup: Must be able to handle 100+ properties without performance issues. Must accommodate dynamic columns for additional data or notes. --- 5. Deliverables 6. Fully Functional Automated Workflow Demonstrates end-to-end process: from an example email/SMS to data populating in Google Sheets with rent estimates and calculations. 7. Configuration & Setup Guide Instructions on how to set up or modify the API keys (RentCast, Twilio, etc.). Instructions on how to edit the Google Sheet formulas or columns. 8. Source Code/Access If code-based: Provide the script files or links to GitHub. If no-code: Provide screenshots or instructions for the Zapier/Make workflows. 9. Testing & Validation At least one test property address to confirm the system retrieves rent data, calculates ROI, and handles the 7+ unit logic. 10. Documentation A short write-up on how to maintain and troubleshoot the system in case of errors (e.g., API downtime, changes in email format). --- 6. Timeline Proposal Submission: Immediately upon job posting. Project Start: Within 1 week of awarding the job. MVP Completion: 1–2 weeks after project start (basic address parsing + rent data retrieval + sheet entry). Final Delivery: 2–3 weeks after project start (include the ROI calculations, 7+ unit handling, thorough testing). --- 7. Budget Open to proposals, with an emphasis on: Minimizing monthly costs (aiming for $15/month total, including the RentCast usage). Ensuring reliability of the automation. --- 8. Selection Criteria 9. Relevant Experience: Experience with property analysis, automating email/SMS parsing, Google Sheets, or Zapier/Make. 10. Portfolio/References: Previous work or references for similar automation tasks. 11. Solution Approach: Clear plan to keep API calls under $0.50/day, handle duplicates, and maintain data integrity. 12. Communication & Documentation: Ability to provide clear instructions and maintenance guidance. --- 9. How to Apply / Next Steps Submit a brief proposal explaining: 1. Your approach (Zapier? Custom script?) 2. High-level architecture you envision 3. Estimated timeline and cost Provide examples or links to similar projects you’ve completed. Include the word “PropertyROI” in your response to confirm you’ve read the details. --- Also want realtor interface to see scenarios and enter repairs or answer missing quality questions about property Bonus $15 if can like with offermarket us for rates AI generated",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Real Estate Cash in Cash determination AI",
    "client_infomation": "United States Washington 10:52 PM $1.9K total spent 83 hires, 29 active 273 hours",
    "rate": "$250.00",
    "url": "https://www.upwork.com/jobs/Real-Estate-Cash-Cash-determination-span-class-highlight-span_~021877148463587724222/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877148463587724222/apply/",
    "upwork_id": "021877148463587724222",
    "job_id": "021877148463587724222",
    "score": 8.0
  },
  "021877146718346218430": {
    "description": "We are looking for an experienced Python developer to create an intelligent\nchat bot powered by AI technologies. The ideal candidate will must have\nexperience in developing agentic flows with frameworks such as LangGraph or\nsimilar. You will be responsible for designing, coding, and testing the bot to\nensure a seamless user experience. Your contribution will be key in enhancing\nour customer interaction processes. If you have a passion for AI and chat\nbots, we want to hear from you!",
    "duration": "1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Chat Bot Development in Python",
    "client_infomation": "nan",
    "rate": "$20.00 - $30.00",
    "url": "https://www.upwork.com/jobs/span-class-highlight-span-Chat-Bot-span-class-highlight-Development-span-Python_~021877146718346218430/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877146718346218430/apply/",
    "upwork_id": "021877146718346218430",
    "job_id": "021877146718346218430",
    "score": 9.0
  },
  "021877139327902878654": {
    "description": "I used Replit, mainly its AI agent, to build and deploy a MERN web app via Replit. I then created a marketing site for it using WordPress and managed subscriptions with WooCommerce.  \n  \nI set up user authentication for the web app to recognize users who have created accounts on my WordPress site. I am using JWT authentification.  \n  \nHowever, I'm having trouble getting it to identify whether they have purchased a subscription and if it is active. The subscription plugin I am using is SUBSCRIPTIONS FOR WOOCOMMERCE by WP Swings.  \n  \nI need a developer to execute this implementation. I want to create a marketing site where users can purchase subscription access and create an account.  \n  \nThen, we can identify if those users have an account and a subscription to the web app. If they have a subscription, I would like to give them access to the web app as long as it is active.  \n  \nI know I used Tailwind CSS and maybe MUI. There are some errors and it would be an added bonus if you can help fix them, but no worries if you can't.  \n  \nAlso, an added bonus if you have a lot of  WooCommerce and WP experience and help clean up the checkout page on my website.  \n  \nPlease NOTE I am looking for someone who has DONE THIS BEFORE.",
    "duration": "< 1 month ",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Need help to identify WooComerce subscription users on my Replit MERN web app",
    "client_infomation": "nan",
    "rate": "$3.00 - $60.00/hr Hourly, Remote Job, One-time project",
    "url": "https://www.upwork.com/jobs/Need-help-identify-WooComerce-subscription-users-Replit-MERN-web-app_~021877139327902878654/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877139327902878654/apply/",
    "upwork_id": "021877139327902878654",
    "job_id": "021877139327902878654",
    "score": 2.0
  },
  "021877136828580039614": {
    "description": "Looking for experienced VAPI.ai developers who have worked with clients\nalready to build ai voice agents.  \n  \nMUST know how to make tools using Make or N8N (you will need to pick up N8N on\nthe job if you don't know it already but it's not hard).  \n  \nMUST know how to figure out APIs you have never experienced before (but you\nhave experienced quite a few already haven't you?)  \n  \nYou must understand how to interact with GHL as well, via API.  \n  \nWe have plenty of work.  Need you to work in US time zone during relatively\nnormal but flexible daytime hours.  \n  \nWill be able to work in a team although you'll have entire projects to work on\nand will be expected to be able to complete them from start to finish based on\nthe specification.  \n  \nMust be scrappy and know how to figure it out using AI, searching, discord and\nbe able to operate on your own and get things done fast.  There's other people\nto ask but you'll be expected to have done your research first.  \n  \nMust be able to deal with a little bit of task switching while we experience\nrapid growth.  \n  \nGetting things done quickly and competently is expected.  \n  \nYou'll give feedback on what you are doing by using a lot of loom and discord\nto demonstrate what you have been working on.  \n  \nIf you want to grow in this industry and get lots of real experience with\nbigger clients, this is the way to do it.  \n  \nIf the image attached scares you, this is probably not the job for you.",
    "duration": "6+ months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "VAPI + N8N (or make)",
    "client_infomation": "United States | $9.4K total spent | 21 hires, 4 active",
    "rate": "$15.00 - $45.00",
    "url": "https://www.upwork.com/jobs/VAPI-N8N-make_~021877136828580039614/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877136828580039614/apply/",
    "upwork_id": "021877136828580039614",
    "job_id": "021877136828580039614",
    "score": 7.0
  },
  "021877134718664772542": {
    "description": "We are a fintech startup seeking an expert in AI agents to help automate\nreceipt processing and integrate with QuickBooks. The ideal candidate will\nhave a strong background in AI technologies and experience in financial\nsoftware automation. You will be responsible for designing and implementing AI\nsolutions that streamline our financial operations, enhancing efficiency and\naccuracy. If you have a passion for fintech and can deliver innovative\nsolutions, we would love to hear from you.",
    "duration": "1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Expert AI Agent Developer for Receipt Automation in Fintech Startup",
    "client_infomation": "United States Chattanooga 8:54 PM $12K total spent 15 hires, 6 active 661 hours Finance & Accounting Small company (2-9 people)",
    "rate": "$20.00-$47.00",
    "url": "https://www.upwork.com/jobs/Expert-span-class-highlight-span-span-class-highlight-Agent-span-span-class-highlight-Developer-span-for-Receipt-Automation-Fintech-Startup_~021877134718664772542/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877134718664772542/apply/",
    "upwork_id": "021877134718664772542",
    "job_id": "021877134718664772542",
    "score": 8.0
  },
  "021877122927637165699": {
    "description": "We are seeking an experienced developer to create a bilingual chatbot for Facebook Marketplace that utilizes AI for automatic responses…",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Chatbot Development for Facebook Marketplace in English and Fr…",
    "client_infomation": "nan",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/span-class-highlight-span-Appointment-span-class-highlight-Agent-span-span-class-highlight-Development-span-Using-SvelteKit_~021877122927637165699/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877122927637165699/apply/",
    "upwork_id": "021877122927637165699",
    "job_id": "021877122927637165699",
    "score": 7.0
  }
}