{
  "021877214995244190654": {
    "description": "We are seeking a skilled Automation Engineer to help develop a solution for automating data entry and form autofill workflows for custom use cases. The project involves creating scripts to input user-provided data into various online forms, ensuring accuracy, efficiency, and seamless operation.  \n  \nProject Scope  \nThe project will focus on creating a robust and flexible automation tool for streamlining data entry tasks. The tool will:  \n  \nRetrieve structured data (e.g., user information, text inputs, file uploads) from a database or API.  \nAutofill and submit the data into specific online forms or systems.  \nImplement techniques to ensure compatibility and reliability across multiple platforms.  \nKey Deliverables  \nCustom Form Autofill Tool:  \n  \nCreate scripts to autofill and submit data into online forms, tailored for each platform.  \nHandle dynamic fields, dropdown menus, file uploads, and multi-step forms.  \nError Handling and Reporting:  \n  \nImplement error detection to identify issues like failed submissions or incorrect data formats.  \nProvide detailed logs to monitor script performance and identify errors.  \nScalable Architecture:  \n  \nDesign a solution that can handle varying volumes of data entry tasks efficiently.  \nEnsure compatibility with different platforms and form structures.  \nPerformance Optimization:  \n  \nMinimize input errors and submission failures.  \nOptimize execution speed while maintaining data accuracy.  \nRequirements  \nTechnical Skills:  \n  \nProficiency in Python or other relevant programming languages.  \nExperience with web automation frameworks like Selenium.  \nAbility to work with APIs, databases, and data manipulation tools.  \nExperience:  \n  \nProven track record of developing automation tools for data entry or form submissions.  \nKnowledge of handling multi-step forms and dynamic fields.  \nProblem-Solving:  \n  \nAbility to troubleshoot and resolve issues with compatibility, form structures, or data mismatches.  \nExperience optimizing workflows for efficiency and reliability.  \nAdditional Information  \nData Source: The data to be entered will be provided via API or other structured formats.  \nTarget Platforms: A list of platforms will be provided, and scripts must be tailored to handle their unique requirements.  \nError Logs: Detailed reporting is essential to monitor performance and troubleshoot issues effectively.  \nThis project is ideal for automation engineers who enjoy creating efficient, reliable tools that simplify repetitive workflows. If you’re interested, please share your experience, examples of similar work, and your proposed approach to building these automation scripts.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Automation Engineer for Custom Data Entry and Form Autofill Tools",
    "client_infomation": "United States Austin 1:29 AM 209 jobs posted 59% hire rate, 1 open job $96K total spent 201 hires, 27 active $6.44 /hr avg hourly rate paid 8,851 hours HR & Business Services Small company (2-9 people) Member since Mar 30, 2019",
    "rate": "$20.00 - $50.00",
    "url": "https://www.upwork.com/jobs/Automation-Engineer-for-Custom-Data-Entry-and-Form-Autofill-Tools_~021877214995244190654/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877214995244190654/apply/",
    "upwork_id": "021877214995244190654",
    "job_id": "021877214995244190654",
    "score": 9.0
  },
  "021877186881994689470": {
    "description": "VIRTUAL ASSISTANT NEEDED WITH SPECIALIST SKILLS IN LEAD GENERATION! SHORT TERM PROJECT WITH POTENTIAL FOR LONG TERM WORK OR FULL TIME ROLE FOR THE RIGHT CANDIDATE  \n  \nWe're on the look out for a virtual assistant to assist in lead generation activities for our company  \n  \nWe are a doors, timber & hardware supply & installation company, working within the residential new home construction industry in Sydney Australia.  \n  \nWe are looking to reach out to new potential clients that fit our ideal avatar profile, which is project home & residential home builders across Sydney.  \n  \nWe are looking for somebody who can provide us with a more detailed version of a data scrape on builders that fit our avatar, so that we have some good in depth knowledge on the company, the key points of contact within the company & some info about previous projects that we may be able to use during our outreaches.  \n  \nYour duties would include:  \n  \n\\- compiling a list of contacts via google search, linkedin, instagram & any other sources that you may find of clients that suit our avatar  \n\\- research the companies to find contact details, office locations, key points of contact details/emails/phone numbers & find information on previous projects they may have completed  \n\\- create profiles in our client database (we use Asana to keep this information) & update them to suit  \n\\- Assist in nurturing these leads as we reach out to them & keeping them up to date in our CRM  \n  \nIdeally, you would have a good knowledge & experience in:  \n  \n\\- Company/profile research  \n\\- Use of Asana software for task management  \n\\- Data management  \n\\- Communication tools such as WhatsApp  \n  \nPlease note that we would require that you have a good level of reading, writing & communication in English for this role.  \n  \nWe have a permanent role available for the right candidate for future administration tasks within the company also!  \n  \nPlease reach out &  I would love to connect, thanks!",
    "duration": "Less than 1 month",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Virtual Assistant - Lead Generation/Data Compilation",
    "client_infomation": "Australia 6:30 PM 3 jobs posted 0% hire rate, 1 open job Member since Jan 18, 2022",
    "rate": "$5.00 - $10.00",
    "url": "https://www.upwork.com/jobs/Virtual-Assistant-Lead-Generation-Data-Compilation_~021877186881994689470/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877186881994689470/apply/",
    "upwork_id": "021877186881994689470",
    "job_id": "021877186881994689470",
    "score": 2.0
  },
  "021877185543940208259": {
    "description": "Looking for a developer to create 4 AI agents that can perform a string of basic tasks including internet searching, reading web pages, identification, and making API calls to record data. The ideal candidate should have experience in AI programming and web automation. The project requires a clear understanding of how to collect and process information from the internet effectively and efficiently.  Multiple long term opportunities available depending on work quality, speed, and communication.  \n  \nRequirements  \n- 4 Similar Scope AI Agents  \n- The agent should be packaged up in a docker compose so that it is easily deployable on our servers  \n- The agent should have detailed runtime logs",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "AI Agent Development for Basic Task Automation | Long Term Position Available",
    "client_infomation": "USA Austin 1:30 AM 13 jobs posted 62% hire rate, 2 open jobs $12K total spent 11 hires, 8 active Tech & IT Small company (2-9 people) Member since Aug 4, 2024",
    "rate": "$650.00",
    "url": "https://www.upwork.com/jobs/Agent-Development-for-Basic-Task-Automation-Long-Term-Position-Available_~021877185543940208259/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877185543940208259/apply/",
    "upwork_id": "021877185543940208259",
    "job_id": "021877185543940208259",
    "score": 8.0
  },
  "021877157270493531541": {
    "description": "We are looking for a skilled Project Consultant to assist in defining, analysing, and documenting the requirements for our online education platform, which is currently in the development phase. This role combines aspects of project management, business analysis, and technical writing to ensure the successful delivery of a comprehensive requirements document for our development team.  Key Responsibilities:  1) Collaborate with the project owner to gather and understand project goals, user needs, and technical requirements.  2) Facilitate a detailed discovery session via video call to outline functional and non-functional requirements.  3)Document clear and structured Software Requirements Specifications (SRS) and related project documents.  4) Act as a liaison between stakeholders and the development team to ensure clarity and alignment of project objectives.  5) Provide input on project management and help define timelines, milestones, and deliverables.  6) Revise and finalize the requirements documentation based on feedback and additional insights.  Qualifications:  Experience in business analysis, project management, and/or technical writing.  Proven ability to gather and document functional and non-functional requirements.  Familiarity with online education platforms or similar systems is a plus.  Strong communication, organizational, and stakeholder management skills.  Knowledge of industry standards for requirements documentation and project workflows.  How to Apply:  If you have experience in project management, business analysis, and requirements writing, please apply with examples of your previous work and your availability for a video call.  We look forward to working with a professional who can help us shape the future of our platform!",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Project Consultant – Business Analysis and Requirements Documentation",
    "client_infomation": "Payment method verified. Phone number verified. Rating is 0 out of 5. 0.00 of 0 reviews. Pakistan. Karachi 12:30 PM. 5 jobs posted. 20% hire rate, 1 open job. $5 total spent. 1 hire, 1 active. Education. Small company (2-9 people). Member since May 30, 2024",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Project-Consultant-Business-Analysis-and-Requirements-Documentation_~021877157270493531541/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877157270493531541/apply/",
    "upwork_id": "021877157270493531541",
    "job_id": "021877157270493531541",
    "score": 3.0
  },
  "021877067559804466819": {
    "description": "Discord Bot for Monitoring Pokémon Card Restocks 1. Project Objective I am looking for a developer to create a Discord bot that monitors a specific website for Pokémon card restocks. When the bot detects that items are back in stock, it should send a notification to a designated Discord channel. 2. Bot Features Website Monitoring: URL: [Insert the website URL]. Monitor specific elements on the website indicating stock availability (e.g., \"In Stock,\" \"Out of Stock\"). Discord Notifications: The notification should include: Product name. Price (if available). A link to the product. Notifications should be sent to a specific channel (provide the channel ID or name). Regular Monitoring: The bot should check the website every [e.g., 60 seconds]. Proxy Support (if needed): If the website blocks automated requests, the bot should support proxy usage or similar solutions. 3. Requirements Programming language: Preferably Python (but other options are acceptable). Documentation: Provide basic setup and usage instructions for the bot. Flexibility: The bot should allow future additions of more websites to monitor. 4. Additional Information Deadline: [Specify your desired timeline, e.g., 1-2 weeks]. Budget: [Specify your budget range, e.g., €100–300 for a basic bot]. Communication: English communication is fine for the project. 5. How to Apply Please include the following in your application: Examples of similar projects you have worked on (if available). Your proposed price and estimated time for completion.",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Discord Bot Developer Needed: Monitor Website for Pokémon Card Restocks",
    "client_infomation": "nan",
    "rate": "$100.00",
    "url": "https://www.upwork.com/jobs/Discord-Bot-Developer-Needed-Monitor-Website-for-Pok-mon-Card-Restocks_~021877067559804466819/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877067559804466819/apply/",
    "upwork_id": "021877067559804466819",
    "job_id": "021877067559804466819",
    "score": 7.0
  },
  "021877049459176574356": {
    "description": "We are seeking experienced developers to create automated web scraping agents capable of collecting, organizing, and delivering real-time data from multiple online platforms. These agents should handle dynamic content, integrate with APIs where available, and operate on a set schedule with minimal manual oversight.  The objective is to develop a robust system that scrapes various websites for specific data fields, ensuring that the extracted data is accurate and well- structured. The solution should include features such as error handling, logging, proxy management, and potential CAPTCHA bypass to maintain smooth operation.  Requirements: 1. Platforms to Scrape: • Reddit (targeted subreddits) • Yahoo Finance forums • Public online forums and discussion sites (specific ones to be discussed upon hiring) 2. Data to Extract: • Post titles • Comments and replies • User interactions (upvotes, replies, timestamps) • Relevant metadata from discussions 3. Automation Features: • Schedule-based execution (e.g., hourly or daily runs) • Error handling and automatic retries with logging • Proxy support and CAPTCHA bypass where needed 4. Output Requirements: • Export structured data in formats such as CSV or JSON • Clear documentation for running, maintaining, and updating the agents 5. Technical Skills Required: • Proficiency in web scraping using tools like Scrapy, BeautifulSoup, Selenium, or Puppeteer • Experience handling dynamic websites and anti-bot mechanisms • Familiarity with API-based data extraction where available • Strong Python skills or similar scripting languages • Solid understanding of data organization and export protocols  We’re looking for candidates who can deliver efficient, well-documented solutions with a strong focus on reliability and accuracy. Clear communication and timely progress updates are also important.  If you have worked on similar projects before, please include examples of your previous work, the tools you used, and any unique challenges you faced.",
    "duration": "1 to 3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Web Scraping Agents Needed for Multi-Platform Data Extraction",
    "client_infomation": "United States | 393 jobs posted | $25K total spent | Member since Jun 8, 2012 | Rating is 4.8 out of 5.",
    "rate": "$15.00 - $25.00",
    "url": "https://www.upwork.com/jobs/Web-Scraping-Agents-Needed-for-Multi-Platform-Data-Extraction_~021877049459176574356/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877049459176574356/apply/",
    "upwork_id": "021877049459176574356",
    "job_id": "021877049459176574356",
    "score": 7.0
  },
  "021877042536184149635": {
    "description": "Improve the scrapping script and deploy in aws: experience with playwright, S3, SQS, AWS, python.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Improve Scrapping Python and Deploy in AWS",
    "client_infomation": "nan",
    "rate": "$30.00",
    "url": "https://www.upwork.com/jobs/Improve-Scrapping-Python-and-Deploy-AWS_~021877042536184149635/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877042536184149635/apply/",
    "upwork_id": "021877042536184149635",
    "job_id": "021877042536184149635",
    "score": 8.0
  },
  "021877040154035932526": {
    "description": "Make.com scenario build that scrapes individual listings from a FindLaw.com search results page and returns the required data from each listing in a organized/structured format",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Make.com Web Scrapper Scenario build",
    "client_infomation": "nan",
    "rate": "$500.00",
    "url": "https://www.upwork.com/jobs/Make-com-Web-Scrapper-Scenario-build_~021877040154035932526/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877040154035932526/apply/",
    "upwork_id": "021877040154035932526",
    "job_id": "021877040154035932526",
    "score": 6.0
  },
  "021877035520946468483": {
    "description": "We welcome the natives of Bulgaria to help us in completion of our project.  We are currently looking to recruit highly-professional, client focused interviewers to work on a variety of projects. Work can be done remotely from Bulgaria as a research Analyst from BRG/ IAL. Focus is to successfully complete Primary research.  \n  \nSkills Required  \n- Successful candidates must speak Bulgarian , and should also be able to communicate effectively in English.  \n-Should be dedicated and result oriented",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Market Researcher -Bulgaria",
    "client_infomation": "nan",
    "rate": "$9.00/hr",
    "url": "https://www.upwork.com/jobs/Market-Researcher-Bulgaria_~021877035520946468483/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877035520946468483/apply/",
    "upwork_id": "021877035520946468483",
    "job_id": "021877035520946468483",
    "score": 1.0
  },
  "021877016448964242260": {
    "description": "I need a tool that monitors this website: <https://www.solanaaihackathon.com/projects>  If there is a new project listed, i should get a notification my discord and the project details ( Project Name + Twitter url + webiste) should be saved in a google sheet.  This should happen in real time.  Experienced scrapers only",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Get notification if website lists a new project",
    "client_infomation": "nan",
    "rate": "$80.00",
    "url": "https://www.upwork.com/jobs/Get-notification-website-lists-new-project_~021877016448964242260/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877016448964242260/apply/",
    "upwork_id": "021877016448964242260",
    "job_id": "021877016448964242260",
    "score": 8.0
  },
  "021877253948823579476": {
    "description": "I already have script. The website changed login system. They added cloudflareToken . I have to generate this when I login. Code  is written by python request.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Python Developer CloudflareToken for Request Script",
    "rate": "$50.00",
    "url": "https://www.upwork.com/jobs/Python-Developer-CloudflareToken-for-Request-Script_~021877253948823579476/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877253948823579476/apply/",
    "upwork_id": "021877253948823579476",
    "client_infomation": "nan",
    "job_id": "021877253948823579476",
    "score": 6.0
  },
  "021877216914499185492": {
    "description": "I'm looking for a CRM like Zoho for a real estate company, this needs to be fully optimized for sales, marketing, and HR. Only people who have created for this type of industry need to apply.",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "CRM development for Real Estate",
    "rate": "Bid range - High $50.00 | Avg $22.40 | Low $6.67",
    "url": "https://www.upwork.com/jobs/CRM-development-for-Real-Estate_~021877216914499185492/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877216914499185492/apply/",
    "upwork_id": "021877216914499185492",
    "client_infomation": "United Arab Emirates | 0% hire rate, 1 open job | Member since Jan 8, 2025",
    "job_id": "021877216914499185492",
    "score": 3.0
  },
  "021877199089835117972": {
    "description": "We are looking for a skilled automation specialist to help us connect Square with Pipedream and potentially other platforms. The ideal candidate will have experience working with APIs, setting up automation workflows, and integrating various software systems. You will be responsible for streamlining our processes through effective automation solutions, ensuring a smooth data flow between platforms. If you have a passion for automation and a knack for problem-solving, we want to hear from you!",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Automation Specialist Needed",
    "rate": "$75.00 - $80.00/hr",
    "url": "https://www.upwork.com/jobs/Automation-Specialist-Needed_~021877199089835117972/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877199089835117972/apply/",
    "upwork_id": "021877199089835117972",
    "client_infomation": "nan",
    "job_id": "021877199089835117972",
    "score": 7.0
  },
  "021877192676903685524": {
    "description": "Join us in showcasing unforgettable events and experiences.  We’re seeking a dynamic professional to amplify our online presence, engage potential clients, and manage campaigns that deliver results.  \n  \nYour Responsibilities  \n- Direct Messaging: Initiate and manage conversations with potential leads to generate interest and engagement.  \n- Campaign Management: Create and manage campaigns using tools like Meta Ads Manager, Google Ads, X, and other platforms.  \n- Content Creation: Develop compelling posts and strategies that align with our target audience.  \n- AI & Automation: Utilize AI tools to enhance workflows and improve campaign outcomes.  \n  \nWhat We’re Looking For  \n- Strong Communication Skills: Clear written English is a must; Spanish is a plus.  \n- Social Media Expertise: Experience in lead generation, ads, and automation tools.  \n- Proactive Mindset: Capable of managing tasks effectively and independently.  \n- Passion for Engagement: Enthusiastic about creating meaningful online interactions.  \n  \nCompensation  \n- Base Pay: Competitive starting rate.  \n- Performance Bonuses: Commissions based on lead generation and campaign success.  \n  \nFuture Opportunities  \nOutstanding performance could lead to involvement in additional exciting projects, including eco-friendly e-commerce initiatives and real estate ventures.  \n  \nWhether you’re an experienced professional or just starting out, if you’re passionate about social media lead generation and campaign management, we want to hear from you.  \n  \nApply now to make an impact!",
    "duration": "More than 6 months 6+ months",
    "experience_level": "Entry level",
    "job_type": "Hourly",
    "title": "Social Media Lead Generation & Outreach Specialist",
    "rate": "Bid range - High $67.00 | Avg $15.25 | Low $3.00",
    "url": "https://www.upwork.com/jobs/Social-Media-Lead-Generation-Outreach-Specialist_~021877192676903685524/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877192676903685524/apply/",
    "upwork_id": "021877192676903685524",
    "client_infomation": "United States New York 2:42 AM 14 jobs posted 58% hire rate, 3 open jobs $1.7K total spent 10 hires, 7 active $5.41 /hr avg hourly rate paid 117 hours Member since Feb 22, 2023",
    "job_id": "021877192676903685524",
    "score": 4.0
  },
  "021877175454806177411": {
    "description": "Reddit and Zapier automation\n\nPosted 6 hours ago\n\nWorldwide\n\nSpecialized profiles can help you better highlight your expertise when\nsubmitting proposals to jobs like these. [Create a specialized\nprofile](/freelancers/).\n\nLook at this article and Youtube video for more info that outlines the\nprocess.\n\n<https://newsletter.chrisjkoerner.com/p/newsletter-00059-9643>\n\n[https://www.youtube.com/watch?v=lO40VRMgNJ8&list=PL5doEXwy4gHVs0Rrk118q7SD1FAYYdAa4&index=2](https://www.youtube.com/watch?v=lO40VRMgNJ8&list=PL5doEXwy4gHVs0Rrk118q7SD1FAYYdAa4&index=2)\n\nIt is a zapier and AI automation process. Also need a subreddit thread.\n\nAlso potentially looking to have help manage it moving forward and posting the\ncomments that the AI creates",
    "duration": "3 to 6 months 3-6 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Reddit and Zapier automation",
    "rate": "$10.00 - $40.00 Hourly",
    "url": "https://www.upwork.com/jobs/Reddit-and-Zapier-automation_~021877175454806177411/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877175454806177411/apply/",
    "upwork_id": "021877175454806177411",
    "client_infomation": "nan",
    "job_id": "021877175454806177411",
    "score": 5.0
  },
  "021877161887843421588": {
    "description": "We are seeking an experienced Python developer to help expand and optimize our existing code for Tradersimpulse, a platform/tool used for risk management for traders. Our goal is to improve performance, add new features, and streamline our existing codebase to ensure a faster and more reliable experience for our users.  \n  \nResponsibilities  \n  \nReview and refactor the current Tradersimpulse Python codebase for efficiency and maintainability.  \nImplement new features and modules based on project requirements.  \n  \nOptimize algorithms for speed and resource usage.  \nEnsure code quality through best practices, including proper documentation and unit testing.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Experienced Python Developer Needed to Enhance & Optimize TradersImpulse Code",
    "rate": "Bid range - High $40.00 | Avg $27.70 | Low $10.00",
    "url": "https://www.upwork.com/jobs/Experienced-Python-Developer-Needed-Enhance-Optimize-TradersImpulse-Code_~021877161887843421588/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877161887843421588/apply/",
    "upwork_id": "021877161887843421588",
    "client_infomation": "USA Katy 1:43 AM 11 jobs posted 28% hire rate, 1 open job $1.1K total spent 3 hires, 1 active Small company (2-9 people) Member since Jul 28, 2024",
    "job_id": "021877161887843421588",
    "score": 7.0
  },
  "021877157238969273278": {
    "description": "Excel sheet has supplier Data which needs to be collected and generate as a Purchase order. The PO can be word or pdf.",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Excel Automation",
    "rate": "Bid range - High $60.00 | Avg $30.44 | Low $9.00",
    "url": "https://www.upwork.com/jobs/Excel-Automation_~021877157238969273278/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877157238969273278/apply/",
    "upwork_id": "021877157238969273278",
    "client_infomation": "Melbourne 6:43 PM | 2 jobs posted | 0% hire rate, 1 open job | Real Estate | Individual client | Member since Feb 1, 2024",
    "job_id": "021877157238969273278",
    "score": 3.0
  },
  "021877154154696084884": {
    "description": "Hi! We are looking for an experienced freelancer to develop an intelligent chatbot system to manage inquiries from clients for a business. The system will integrate multiple communication platforms (Facebook, WhatsApp, Instagram, and Google Ads) into a single centralized solution.  \n  \nJob description:  \n-Setup of the chat system and message classification.  \n-Integration with ChatGPT for natural and accurate responses.  \n-Integrating leads into Monday.com for lead tracking and reporting.  \n-Integration with Google Ads for performance metrics and ROI tracking.  \n-Making adjustments after client use and resolving doubts.  \n  \nDeliverables:  \n-Fully functional chatbot system.  \n-Dashboard in Monday.com.  \n-Configured integrations.  \n-User manual.  \n-Training session recordings.  \n  \nThis is a short term project and needs to be delivered within this week\n(Thursday or Friday). If you are available and have experience on this sort of\nproject, we’d love to hear from you!",
    "duration": "short term",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "Expert Freelancer for Automation and CRM Integration",
    "rate": "$150.00",
    "url": "https://www.upwork.com/jobs/Expert-Freelancer-for-Automation-and-CRM-Integration_~021877154154696084884/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877154154696084884/apply/",
    "upwork_id": "021877154154696084884",
    "client_infomation": "nan",
    "job_id": "021877154154696084884",
    "score": 8.0
  },
  "021877168792842341310": {
    "description": "We are seeking skilled engineers to join our team in developing a cutting-edge\nservice utilizing AI Agents powered by Large Language Models (LLMs). This\nproject involves designing, implementing, and optimizing AI-driven solutions\nto enhance user experience and efficiency. Ideal candidates should have a\nstrong understanding of AI technologies and experience in LLMs. If you are\npassionate about innovation and eager to work with advanced AI solutions, we\nwould love to hear from you!",
    "duration": "1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Agent Development with LLMs",
    "client_infomation": "Member since Jan 9, 2025 Japan 10:51 AM Finance & Accounting Small company (2-9 people)",
    "rate": "$3.00 - $40.00",
    "url": "https://www.upwork.com/jobs/span-class-highlight-span-span-class-highlight-Agent-span-span-class-highlight-Development-span-with-LLMs_~021877168792842341310/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877168792842341310/apply/",
    "upwork_id": "021877168792842341310",
    "job_id": "021877168792842341310",
    "score": 9.0
  },
  "021877164623373019988": {
    "description": "StudyTaco is a venture-backed EdTech startup revolutionising learning by blending behavioural science, neuroscience, and gamification. Our mission is to transform how students approach complex subjects, turning exam prep into an engaging and effective experience. With a growing user base and two initial games launched, we’re ready to scale and need a talented engineer to join our founding team. The Role We’re seeking a Founding Engineer to take ownership of StudyTaco’s technical vision and architecture. As a key founding team member, you’ll work closely with the two co-founders—focused on product/operations and growth/commercials—to design, build, and scale our gamified learning platform. This is a hands-on role, ideal for someone with a passion for building engaging, interactive products from the ground up. Given our vision of gamifying learning, a background in game development or experience creating engaging, interactive experiences is highly desirable. What You’ll Do - Lead the end-to-end development of StudyTaco’s platform, including backend architecture, front-end interfaces, and AI-driven features. - Integrate gamification and behavioural science into the product to create seamless, engaging user experiences. - Ensure the platform is scalable and robust as we grow our user base. - Collaborate with the co-founders to align technical decisions with business strategy and product goals. - Build and eventually mentor a world-class engineering team as the company grows. What We’re Looking For Technical Skills - Proficiency in full-stack development (e.g., React, Node.js, Python, or similar). - Experience with cloud infrastructure (AWS, GCP, or Azure). - Background in game development or gamification is a strong plus. - Familiarity with AI/ML integration and behavioural science concepts is highly desirable. Mindset - Passion for creating engaging, user-centered products. - Entrepreneurial spirit and a willingness to take ownership. - Thrives in a fast-paced, collaborative startup environment. Experience - 3+ years in software engineering, ideally with experience in startups or consumer-focused products. - Previous experience building or scaling a tech product is a big advantage.",
    "duration": "6+ months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Founding Engineer for Gamified EdTech Platform",
    "client_infomation": "United Kingdom | $14K total spent | 71 hires, 3 active",
    "rate": "$45.00-$100.00",
    "url": "https://www.upwork.com/jobs/Founding-Engineer-for-Gamified-EdTech-Platform_~021877164623373019988/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877164623373019988/apply/",
    "upwork_id": "021877164623373019988",
    "job_id": "021877164623373019988",
    "score": 7.0
  },
  "021877155818941314691": {
    "description": "I have set up a OneNote document for my project. I’ve started collecting\nbackground information from the web or documents people send m…",
    "duration": "null",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Convert PDF printouts to searchable text and add to OneNote",
    "client_infomation": "nan",
    "rate": "$20",
    "url": "https://www.upwork.com/jobs/Data-Entry-and-Administrative-Support-with-Canva-Design-Skills_~021877155818941314691/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877155818941314691/apply/",
    "upwork_id": "021877155818941314691",
    "job_id": "021877155818941314691",
    "score": 2.0
  },
  "021877150818072655491": {
    "description": "Hi - I am looking to hire someone to help me troubleshoot a sales campaign\nthat I set up in instantly.ai. I set up a gmail account to…",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Instantly.ai sales campaign set-up and management",
    "client_infomation": "nan",
    "rate": "Less than 30 hrs/week",
    "url": "https://www.upwork.com/jobs/Automation-span-class-highlight-Developer-span-for-Cold-Lead-Generation-Workflow-with-Apollo-and-CRM-Integration_~021877150818072655491/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877150818072655491/apply/",
    "upwork_id": "021877150818072655491",
    "job_id": "021877150818072655491",
    "score": 3.0
  },
  "021877148463587724222": {
    "description": "I am seeking a developer or automation specialist to build a system that:\n\n1. Parses incoming property leads (via email and/or SMS) to extract relevant\ninformation (address, price, units, etc.).\n\n2. Queries RentCast (or a similar rent estimate service) to gather rental\ndata (current rent, rent comps, etc.).\n\n3. Populates a Google Sheet with key data (address, rent estimate, cash-on-\ncash return, etc.).\n\n4. Handles special logic for multi-unit properties (7+ units) to store or\ntransform data differently.\n\n5. Keeps daily API costs to under $0.50/day.\n\n\n---\n\n2. Project Goals\n\n\n\nAutomation: Eliminate manual copy-pasting of property addresses, rent\nestimates, and ROI calculations.\n\nAccuracy: Ensure data extracted and rent estimates are consistently accurate.\n\nScalability & Cost Control: Handle a growing number of leads while staying\nwithin a $0.50/day API budget.\n\n\n\n---\n\n3. Scope and Requirements\n\n\n\n3.1. Data Capture & Parsing\n\n1. Sources: The system should capture data from:\n\nEmail: Some leads arrive via email (with property details or direct links to\nlistings).\n\nText Messages (SMS): Some leads arrive via text, which may be forwarded\nthrough services like Twilio or Zapier.\n\n\n\n2. Parsing Fields:\n\nAddress (required for RentCast lookup)\n\nProperty Purchase Price (if available)\n\nNumber of Units (important for 7+ unit logic)\n\nAny additional fields that might be relevant (e.g., link to the listing,\nagent’s contact info, etc.).\n\n\n\n3. Preferred Tools (flexible):\n\nZapier, Make (Integromat), or a custom solution in Python/Node.js/Google Apps\nScript.\n\nMust ensure reliability and easy maintainability.\n\n\n\n\n3.2. RentCast Integration\n\n1. Retrieve Rent Estimates:\n\nUse RentCast’s API (or equivalent) to get current rent, high/low estimates, or\naverage rents for the ZIP code.\n\nIf the property listing already contains the current rent, incorporate that\ninto the data.\n\n\n\n2. API Cost Constraints:\n\nThe system should not exceed $0.50/day in API usage.\n\nMinimize duplicates: Only call RentCast once per unique address.\n\nPotentially batch calls or check for repeated addresses.\n\n\n\n\n3.3. Google Sheets Integration\n\n1. Data Columns in Google Sheets should include (but aren’t limited to):\n\nTimestamp (date the lead was processed)\n\nAddress\n\nPurchase Price\n\nNumber of Units\n\nMonthly Rent Estimate\n\nOther rent comps or relevant data from RentCast\n\nCash-on-Cash Return (see next section)\n\nNotes or Status field for manual follow-up.\n\n\n\n2. Handling 7+ Units:\n\nIf Units less than 7, either:\n\nInsert data into a separate tab (e.g., “7+ Units” tab), or\n\nEncode or summarize the data differently (e.g., partial data, redacted\nfinancials).\n\n\n\n\n\n3.4. Cash-on-Cash Return Calculation\n\n1. Inputs:\n\nPurchase Price (from the lead or manually estimated)\n\nRent (from the listing and/or RentCast estimates)\n\nDown Payment (might be a standard % or a column in the sheet)\n\nExpenses (option to assume a percentage or a fixed amount)\n\nMortgage Payment (if financed; can be estimated or left as a variable input)\n\n\n\n2. Formula:\n\nAnnual Net Cash Flow = (Monthly Rent – Monthly Expenses – Mortgage) × 12\n\nTotal Cash Invested = Down Payment + Closing Costs (if applicable)\n\nCash-on-Cash Return % = (Annual Net Cash Flow / Total Cash Invested) × 100\n\n\n\n3. Implementation:\n\nCan be calculated within Google Sheets (preferred for easier tweaking of\nassumptions).\n\nAlternatively, can be calculated in the automation script.\n\n\n\n\n3.5. Error Handling & Edge Cases\n\n1. Duplicate Addresses: If the same property address is sent multiple times,\nensure we do not duplicate RentCast calls unnecessarily.\n\n\n2. Missing Data: Some leads may be missing purchase price or unit count. The\nsystem should log them but still attempt to fill whatever data is available.\n\n\n3. Notification/Logging: If a lead is processed successfully, optionally send\na notification (email or Slack) if it meets a certain ROI threshold\n(optional).\n\n\n\n\n---\n\n4. Technical Details & Constraints\n\n\n5. Platform/Hosting:\n\nIf using a no-code tool (Zapier, Make), you must specify the steps needed.\n\nIf using a custom script (e.g., Google Apps Script or a serverless function),\nit must be well-documented for future maintenance.\n\n\n\n6. User Authentication:\n\nSecurely handle the RentCast API key (do not store in plain text in public\ncode repositories).\n\n\n\n7. Daily API Budget:\n\nProvide a method to track the number of calls to ensure we stay under\n$0.50/day.\n\nImplement caching or a check on previously-seen addresses.\n\n\n\n8. Google Sheet Setup:\n\nMust be able to handle 100+ properties without performance issues.\n\nMust accommodate dynamic columns for additional data or notes.\n\n\n\n\n\n---\n\n5. Deliverables\n\n\n6. Fully Functional Automated Workflow\n\nDemonstrates end-to-end process: from an example email/SMS to data populating\nin Google Sheets with rent estimates and calculations.\n\n\n\n7. Configuration & Setup Guide\n\nInstructions on how to set up or modify the API keys (RentCast, Twilio, etc.).\n\nInstructions on how to edit the Google Sheet formulas or columns.\n\n\n\n8. Source Code/Access\n\nIf code-based: Provide the script files or links to GitHub.\n\nIf no-code: Provide screenshots or instructions for the Zapier/Make workflows.\n\n\n\n9. Testing & Validation\n\nAt least one test property address to confirm the system retrieves rent data,\ncalculates ROI, and handles the 7+ unit logic.\n\n\n\n10. Documentation\n\nA short write-up on how to maintain and troubleshoot the system in case of\nerrors (e.g., API downtime, changes in email format).\n\n\n\n\n\n---\n\n6. Timeline\n\n\n\nProposal Submission: Immediately upon job posting.\n\nProject Start: Within 1 week of awarding the job.\n\nMVP Completion: 1–2 weeks after project start (basic address parsing + rent\ndata retrieval + sheet entry).\n\nFinal Delivery: 2–3 weeks after project start (include the ROI calculations,\n7+ unit handling, thorough testing).\n\n\n\n---\n\n7. Budget\n\n\n\nOpen to proposals, with an emphasis on:\n\nMinimizing monthly costs (aiming for $15/month total, including the RentCast\nusage).\n\nEnsuring reliability of the automation.\n\n\n\n---\n\n8. Selection Criteria\n\n\n9. Relevant Experience: Experience with property analysis, automating\nemail/SMS parsing, Google Sheets, or Zapier/Make.\n\n\n10. Portfolio/References: Previous work or references for similar automation\ntasks.\n\n\n11. Solution Approach: Clear plan to keep API calls under $0.50/day, handle\nduplicates, and maintain data integrity.\n\n\n12. Communication & Documentation: Ability to provide clear instructions and\nmaintenance guidance.\n\n\n\n\n---\n\n9. How to Apply / Next Steps\n\n\n\nSubmit a brief proposal explaining:\n\n1. Your approach (Zapier? Custom script?)\n\n\n2. High-level architecture you envision\n\n\n3. Estimated timeline and cost\n\n\n\nProvide examples or links to similar projects you’ve completed.\nInclude the word “PropertyROI” in your response to confirm you’ve read the\ndetails.\n\n\n---\n\nAlso want realtor interface to see scenarios and enter repairs or answer\nmissing quality questions about property\n\nBonus $15 if can like with offermarket us for rates\n\nAI generated",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Real Estate Cash in Cash determination AI",
    "client_infomation": "nan",
    "rate": "$250.00",
    "url": "https://www.upwork.com/jobs/Real-Estate-Cash-Cash-determination-span-class-highlight-span_~021877148463587724222/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877148463587724222/apply/",
    "upwork_id": "021877148463587724222",
    "job_id": "021877148463587724222",
    "score": 8.0
  },
  "021877146718346218430": {
    "description": "We are looking for an experienced Python developer to create an intelligent\nchat bot powered by AI technologies. The ideal candidate will must have\nexperience in developing agentic flows with frameworks such as LangGraph or\nsimilar. You will be responsible for designing, coding, and testing the bot to\nensure a seamless user experience. Your contribution will be key in enhancing\nour customer interaction processes. If you have a passion for AI and chat\nbots, we want to hear from you!",
    "duration": "1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Chat Bot Development in Python",
    "client_infomation": "nan",
    "rate": "$20.00 - $30.00",
    "url": "https://www.upwork.com/jobs/span-class-highlight-span-Chat-Bot-span-class-highlight-Development-span-Python_~021877146718346218430/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877146718346218430/apply/",
    "upwork_id": "021877146718346218430",
    "job_id": "021877146718346218430",
    "score": 9.0
  },
  "021877139327902878654": {
    "description": "I used Replit, mainly its AI agent, to build and deploy a MERN web app via\nReplit. I then created a marketing site for it using WordPress and managed\nsubscriptions with WooCommerce.  \n  \nI set up user authentication for the web app to recognize users who have\ncreated accounts on my WordPress site. I am using JWT authentification.  \n  \nHowever, I'm having trouble getting it to identify whether they have purchased\na subscription and if it is active. The subscription plugin I am using is\nSUBSCRIPTIONS FOR WOOCOMMERCE by WP Swings.  \n  \nI need a developer to execute this implementation. I want to create a\nmarketing site where users can purchase subscription access and create an\naccount.  \n  \nThen, we can identify if those users have an account and a subscription to the\nweb app. If they have a subscription, I would like to give them access to the\nweb app as long as it is active.  \n  \nI know I used Tailwind CSS and maybe MUI. There are some errors and it would\nbe an added bonus if you can help fix them, but no worries if you can't.  \n  \nAlso, an added bonus if you have a lot of  WooCommerce and WP experience and\nhelp clean up the checkout page on my website.  \n  \nPlease NOTE I am looking for someone who has DONE THIS BEFORE.",
    "duration": "< 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Need help to identify WooComerce subscription users on my Replit MERN web app",
    "client_infomation": "nan",
    "rate": "$3.00 - $60.00 Hourly",
    "url": "https://www.upwork.com/jobs/Need-help-identify-WooComerce-subscription-users-Replit-MERN-web-app_~021877139327902878654/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877139327902878654/apply/",
    "upwork_id": "021877139327902878654",
    "job_id": "021877139327902878654",
    "score": 3.0
  },
  "021877136828580039614": {
    "description": "Looking for experienced VAPI.ai developers who have worked with clients\nalready to build ai voice agents.  \n  \nMUST know how to make tools using Make or N8N (you will need to pick up N8N on\nthe job if you don't know it already but it's not hard).  \n  \nMUST know how to figure out APIs you have never experienced before (but you\nhave experienced quite a few already haven't you?)  \n  \nYou must understand how to interact with GHL as well, via API.  \n  \nWe have plenty of work.  Need you to work in US time zone during relatively\nnormal but flexible daytime hours.  \n  \nWill be able to work in a team although you'll have entire projects to work on\nand will be expected to be able to complete them from start to finish based on\nthe specification.  \n  \nMust be scrappy and know how to figure it out using AI, searching, discord and\nbe able to operate on your own and get things done fast.  There's other people\nto ask but you'll be expected to have done your research first.  \n  \nMust be able to deal with a little bit of task switching while we experience\nrapid growth.  \n  \nGetting things done quickly and competently is expected.  \n  \nYou'll give feedback on what you are doing by using a lot of loom and discord\nto demonstrate what you have been working on.  \n  \nIf you want to grow in this industry and get lots of real experience with\nbigger clients, this is the way to do it.  \n  \nIf the image attached scares you, this is probably not the job for you.",
    "duration": "6+ months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "VAPI + N8N (or make)",
    "client_infomation": "United States | $9.4K total spent | 21 hires, 4 active",
    "rate": "$15.00-$45.00",
    "url": "https://www.upwork.com/jobs/VAPI-N8N-make_~021877136828580039614/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877136828580039614/apply/",
    "upwork_id": "021877136828580039614",
    "job_id": "021877136828580039614",
    "score": 7.0
  },
  "021877134718664772542": {
    "description": "We are a fintech startup seeking an expert in AI agents to help automate\nreceipt processing and integrate with QuickBooks. The ideal candidate will\nhave a strong background in AI technologies and experience in financial\nsoftware automation. You will be responsible for designing and implementing AI\nsolutions that streamline our financial operations, enhancing efficiency and\naccuracy. If you have a passion for fintech and can deliver innovative\nsolutions, we would love to hear from you.",
    "duration": "1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Expert AI Agent Developer for Receipt Automation in Fintech Startup",
    "client_infomation": "nan",
    "rate": "$20.00 - $47.00 Hourly",
    "url": "https://www.upwork.com/jobs/Expert-span-class-highlight-span-span-class-highlight-Agent-span-span-class-highlight-Developer-span-for-Receipt-Automation-Fintech-Startup_~021877134718664772542/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877134718664772542/apply/",
    "upwork_id": "021877134718664772542",
    "job_id": "021877134718664772542",
    "score": 8.0
  },
  "021877122927637165699": {
    "description": "We are seeking an experienced developer to create a bilingual chatbot for\nFacebook Marketplace that utilizes AI for automatic responses…",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Chatbot Development for Facebook Marketplace in English and Fr…",
    "client_infomation": "nan",
    "rate": "Less than 30 hrs/week",
    "url": "https://www.upwork.com/jobs/span-class-highlight-span-Appointment-span-class-highlight-Agent-span-span-class-highlight-Development-span-Using-SvelteKit_~021877122927637165699/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877122927637165699/apply/",
    "upwork_id": "021877122927637165699",
    "job_id": "021877122927637165699",
    "score": 6.0
  },
  "021877246149740429217": {
    "description": "We are seeking a highly experienced Asana Integration Expert to help review, optimize, and integrate our existing Asana setup with other tools in our tech stack, including Slack, Intercom, and more. Our current build is extensive, with over 300 projects and 8 portfolios, but we believe there is significant room for improvement to automate our processes and utilize Asana’s full potential.\n\nThis role will start with an initial discovery phase to assess our current setup and provide recommendations for improvements. From there, you’ll help implement integrations, automate workflows, and create a plan to restructure and optimize our build.\n\nIf your skillset aligns please share a loom video highlighting some of the automations and Asana builds you have developed.\n\nResponsibilities:\n- Conduct a discovery session to evaluate our current Asana setup.\nIdentify inefficiencies and propose improvements for automating workflows.\n- Integrate Asana with other tools such as Slack, Intercom, and additional platforms in our tech stack.\n- Implement Asana features we’re not fully utilizing, such as advanced automations, timelines, capacity planning, and reporting.\n- Develop a long-term plan to restructure our Asana build for maximum efficiency and scalability.\nProvide hands-on support for creating custom automations to reduce manual processes.\n\nQualifications:\n- Proven experience as an Asana expert with advanced knowledge of its features and integrations.\n- Strong background in integrating Asana with third-party tools (e.g., Slack, Intercom).\n- Familiarity with large-scale Asana builds (e.g., 300+ projects, multiple portfolios).\n- Experience automating workflows and optimizing processes in Asana.\n- Excellent problem-solving and organizational skills.\n- Strong communication skills to work closely with stakeholders and provide clear recommendations.\n\nImmediate Tasks\n- Automate task due dates using custom fields within our portfolios\n- Develop post-call/stage forms with built-in automations for notification alerts\n- Set up notifications for task incompletion/completion\n- Automated follow up slack messages or emails based on tasks\n- Integrate with Slack\n- Integrate with Intercom\n\n\nPreferred Qualifications:\n- Knowledge of API-based integrations and advanced automation tools.\n- Experience working with teams in a fast-paced, tech-driven environment.\n\nPosition Details:\nSchedule: Part-time, as-needed basis (Monday through Friday, 9 AM–5 PM EST).",
    "duration": "3 to 6 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Asana Integration Expert",
    "client_infomation": "United States Miami 4:25 AM 40 jobs posted 88% hire rate, 3 open jobs $198K total spent 58 hires, 14 active $16.76 /hr avg hourly rate paid 10,373 hours Tech & IT Mid-sized company (10-99 people) Member since Oct 22, 2021",
    "rate": "$15.00 - $30.00",
    "url": "https://www.upwork.com/jobs/Asana-Integration-Expert_~021877246149740429217/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877246149740429217/apply/",
    "upwork_id": "021877246149740429217",
    "job_id": "021877246149740429217",
    "score": 7.0
  },
  "021877125997813167747": {
    "description": "Hi.\n\nI am a proficient and longtime user of Zapier.\n\nI am looking to possibly transition over to Make.com, and I am looking for someone to work with me in real-time over Zoom to create a few scenarios.\n\nThe main scenario that I am interested in creating will connect Intercom's Help Center with a Notion db. I would like for the Notion db to create, update, or delete a Notion page each time an Intercom Help Center article is created, updated or deleted.\n\nThis means there would be a Notion db that is in sync with the Intercom Help Center\n\nMake has an Intercom connection, but I believe this will require using Intercom's API instead of the prebuilt options in Make.com.\n\nFor this reason, I'm looking for someone who:\n1) Will work in real-time over Zoom so that I can learn Make.com\n2) Is familiar with using webhooks in Make",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Make.com Scenario Building",
    "client_infomation": "nan",
    "rate": "$8.00 - $25.00/hr",
    "url": "https://www.upwork.com/jobs/Make-com-Scenario-Building_~021877125997813167747/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877125997813167747/apply/",
    "upwork_id": "021877125997813167747",
    "job_id": "021877125997813167747",
    "score": 6.0
  },
  "021877121233788466819": {
    "description": "• Requirements:  \n• Expertise in building on Softr.io and working with Airtable data.  \n• Fluent in English (both written and spoken).  \n• Able to log in and work collaboratively in real-time.  \n• Important Notes:  \n• No third-party involvement or subcontracting of work will be allowed.  \n• You must log in with me to verify that you are the person I’ve hired.  \n• I will be using Upwork’s tracking to monitor time.  \n• Additional Information:  \n• Please do not respond if you are not the person who will be creating this.",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "SOFTR.io & AIRABLE data",
    "client_infomation": "United States Elberta 4:26 AM 19 jobs posted 64% hire rate, 1 open job $2.5K total spent 13 hires, 4 active $8.64 /hr avg hourly rate paid 68 hours Member since Oct 22, 2012",
    "rate": "Bid range - High $200.00 | Avg $75.43 | Low $3.00",
    "url": "https://www.upwork.com/jobs/SOFTR-AIRABLE-data_~021877121233788466819/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877121233788466819/apply/",
    "upwork_id": "021877121233788466819",
    "job_id": "021877121233788466819",
    "score": 3.0
  },
  "021877118975718001598": {
    "description": "Hello, we are looking to develop a calling / texting bot that can call our incoming leads for my energy saving HVAC business in Ontario Canada. I need it to be able to follow up with new leads over a 1 month workflow, and if the customer has positive intent, continue following up and calling until the client is booked. After being booked, we need the data to be collected and sent to our crm",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Mass cold calling bot / texting bot",
    "client_infomation": "Canada | 1 job posted | 0% hire rate, 1 open job | Small company (2-9 people) | Member since Jan 8, 2025 | Phone number verified | Payment method not verified",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Mass-cold-calling-bot-texting-bot_~021877118975718001598/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877118975718001598/apply/",
    "upwork_id": "021877118975718001598",
    "job_id": "021877118975718001598",
    "score": 7.0
  },
  "021877116848737943340": {
    "description": "We are building a cutting-edge AI-driven sales automation platform designed to streamline the entire sales development process. The platform includes the following step-by-step features to empower sales teams:  \n  \n1. Lead Identification and Prospecting: Automatically scrape data from large databases such as LinkedIn Sales Navigator or Apollo to identify high-potential leads based on predefined criteria like industry, role, and company size.  \n  \n2. Personalized Outreach: Generate tailored email content using advanced AI to craft compelling messages that resonate with each lead's specific pain points.  \n  \n3. AI-Powered Follow-Up Calls: Leverage a unique voice-cloning feature to replicate the user's voice and enable an AI chatbot to conduct follow-up calls that sound natural and personalized.  \n  \n4.Meeting Scheduling: Seamlessly integrate with scheduling systems to send meeting invitations based on the lead’s availability and preferences, ensuring a smooth transition to the next stage of engagement.  \n  \n5. Conversational AI Engagement: Use conversational AI during calls to answer questions, address objections, and gather feedback from leads in real-time.  \n  \n6. CRM Tracking and Automation: Log all interactions, including emails, calls, and meetings, into a central CRM for tracking and analysis, providing sales teams with actionable insights.  \n  \nThis platform enables sales teams to save time, scale outreach efforts, and focus on closing deals, while ensuring each prospect receives a personalized and professional experience.",
    "duration": "Complex project",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "AI-Powered Sales Automation Platform Development Build on Zapier/Make.com",
    "client_infomation": "nan",
    "rate": "$5,000.00",
    "url": "https://www.upwork.com/jobs/Powered-Sales-Automation-Platform-Development-Build-Zapier-Make-com_~021877116848737943340/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877116848737943340/apply/",
    "upwork_id": "021877116848737943340",
    "job_id": "021877116848737943340",
    "score": 8.0
  },
  "021877108360978757251": {
    "description": "i am looking for someone to connect zippier and drobox together i am looking to have my video's automatically load from drop box to bunny cdn. please experienced only",
    "duration": "Less than 1 month < 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Zap expert",
    "client_infomation": "Payment method verified Phone number verified Rating is 0 out of 5. 0 0.00 of 0 reviews USA Las Vegas 2:27 AM 5 jobs posted 40% hire rate, 3 open jobs $856 total spent 2 hires, 2 active $35.00 /hr avg hourly rate paid 15 hours Real Estate Small company (2-9 people) Member since Oct 22, 2024",
    "rate": "Bid range - High $80.00 | Avg $36.88 | Low $15.00",
    "url": "https://www.upwork.com/jobs/Zap-expert_~021877108360978757251/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877108360978757251/apply/",
    "upwork_id": "021877108360978757251",
    "job_id": "021877108360978757251",
    "score": 3.0
  },
  "021877108177792936788": {
    "description": "We are seeking a skilled professional to help automate our SEO agency's workflow using Make.com. Our SEO specialist will guide you in the process of what's really needed. The project involves streamlining processes from keyword research to content publishing, competitors and serp analysis, enabling us to operate more efficiently. If you have experience with automation tools and a deep understanding of SEO practices, we want to hear from you! This role requires a proactive approach and the ability to integrate various SEO tasks into a seamless workflow.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "SEO Agency Automation Specialist Needed for Agency Workflow - make.com",
    "client_infomation": "Morocco Casablanca 8:27 AM 1 job posted 0% hire rate, 1 open job Sales & Marketing Small company (2-9 people) Member since Jan 8, 2025",
    "rate": "$150.00",
    "url": "https://www.upwork.com/jobs/SEO-Agency-Automation-Specialist-Needed-for-Agency-Workflow-make-com-specialist_~021877108177792936788/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877108177792936788/apply/",
    "upwork_id": "021877108177792936788",
    "job_id": "021877108177792936788",
    "score": 5.0
  },
  "021877069638723827331": {
    "description": "We are seeking an experienced automation expert to help build and optimize workflows using Make.com with Monday.com as the primary data source. If you have a strong background in designing efficient automations and documenting processes clearly, we’d love to work with you!  \n  \nKey Responsibilities:  \n- Develop and implement automations in Make.com, integrating with Monday.com.  \n- Streamline workflows and enhance data processes using both platforms.  \n- Identify and troubleshoot issues in automations to ensure optimal performance.  \n- Create detailed procedure documents outlining the design, implementation, and maintenance of the automations.  \n  \nRequirements:  \n- Proven experience building automations in Make.com.  \n- Hands-on expertise working with Monday.com as a data source.  \n- Strong problem-solving skills and attention to detail.  \n- Ability to document technical workflows in a clear, step-by-step manner.  \n- Strong communication skills to discuss and refine automation requirements.  \n  \nHow to Apply:  \nPlease include the following in your application:  \n  \n1. A brief summary of your experience with Make.com.  \n2. Examples of automations or similar projects you’ve built.  \n3. A sample of procedure documentation you’ve created.  \n  \nWe’re excited to collaborate with someone passionate about automation and process optimization. Apply now to join our project!",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Make.com Automation Specialist",
    "client_infomation": "United States | 27 jobs posted | 8% hire rate, 2 open jobs | $885 total spent | 2 hires, 2 active | $21.55 /hr avg hourly rate paid | Member since Aug 25, 2023",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Make-com-Automation-Specialist_~021877069638723827331/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877069638723827331/apply/",
    "upwork_id": "021877069638723827331",
    "job_id": "021877069638723827331",
    "score": 6.0
  },
  "021877068166682578324": {
    "description": "We are seeking an experienced freelancer to help to create a make.com flow that categorize emails effectively, eliminating spam and unnecessary notifications. This will allow us to focus on the important messages that matter most. Familiarity with make.com is essential, as you will use this platform to automate workflows and improve email management. If you have a strong background in email organization and automation, we'd love to hear from you!  Before start i would know what % of efficency can reach the system and if i can trust without check so many times that AI have done nice work, also i need understand if AI have to be trained or a description is enough",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Ai flow Email Categorization and Spam Filtering Expert Needed",
    "client_infomation": "nan",
    "rate": "$150.00",
    "url": "https://www.upwork.com/jobs/flow-Email-Categorization-and-Spam-Filtering-Expert-Needed_~021877068166682578324/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877068166682578324/apply/",
    "upwork_id": "021877068166682578324",
    "job_id": "021877068166682578324",
    "score": 7.0
  },
  "021877273127961884291": {
    "description": "We are looking for talented professionals with:  ✅ Strong expertise in Python  ✅ Hands-on experience with LLM models (e.g., OpenAI, Gemini, Claude)  ✅ Proficiency in Multi-Agent Platforms like Crew.AI, Langflow, and others  ✅ Solid skills in Prompt Engineering  ✅ Experience with Retrieval-Augmented Generation (RAG) for AI workflows  If this sounds like you, let’s connect!",
    "duration": "6+ months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Agent Developer & Prompt Engineer",
    "client_infomation": "Payment method verified | Phone number verified | Rating is 0 out of 5. 0.00 of 0 reviews | India | Mohali 2:17 PM | 11 jobs posted, 10% hire rate, 2 open jobs | $50 total spent, 1 hire, 1 active | Member since Mar 14, 2024",
    "url": "https://www.upwork.com/jobs/Agent-Developer-Prompt-Engineer_~021877273127961884291/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877273127961884291/apply/",
    "upwork_id": "021877273127961884291",
    "rate": "nan",
    "job_id": "021877273127961884291",
    "score": 9.0
  },
  "021877271390848939651": {
    "description": "We are seeking a skilled AI developer to build intelligent chatbots for our company.  \n  \nInternal Chatbot: Designed to assist helpdesk agents within the Zoho Desk platform.  \nThis chatbot will reside in the ticket sidebar, providing real-time suggestions and solutions based on our internal knowledge base.  \nCustomer-Facing Chatbot: Intended to interact directly with our customers, offering support and resolving common inquiries. Should propose solutions and answers based on the same data sources but tailored for customers.  \n  \n  \nChatbot Development:  \nDesign and develop both internal and customer-facing chatbots.  \nIntegrate the chatbots seamlessly within the Zoho Desk environment.  \nCustomizable LLM Options:  \nThe chatbots must support multiple LLMs (e.g., OpenAI, Claude, and others).  \nAbility to easily select the LLM used.(by admin)  \n  \nKnowledge Base Integration:  \nTrain the chatbots on a comprehensive knowledge base comprising:  \nZoho Help Center articles  \nExisting Zoho Desk tickets  \nA legacy wiki  \n  \nAbility to configure which information is available to customers vs. agents.  \n  \nSupport for responses in French and English.  \n  \nDeliverables  \n    Fully functional helpdesk chatbot integrated with Zoho Desk.  \n    Fully functional customer chatbot integrated with Zoho Help Center or to be used on any website.  \n    Customizable configurations for data source usage and LLM selection.  \n    Documentation and training materials for maintaining and updating the chatbots.",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Developer Needed for Chatbot Development",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Developer-Needed-for-Chatbot-Development_~021877271390848939651/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877271390848939651/apply/",
    "upwork_id": "021877271390848939651",
    "rate": "$10.00 - $25.00 Hourly",
    "job_id": "021877271390848939651",
    "score": 8.0
  },
  "021877270090493136276": {
    "description": "Hi,  We’re looking for an experienced NLP Engineer to mentor our junior NLP developer on a project. Your role would involve providing guidance and helping resolve any challenges that may arise. Our team member is smart, quick to learn, and eager to improve.  We understand that our hourly budget for this role is on the lower side, but it's a fixed amount we can allocate for now.  We would require around 5-10 hours throughout the month.  Thanks!",
    "duration": "1 to 3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Looking for NLP Expert to Mentor our Junior NLP Developer",
    "client_infomation": "United Arab Emirates | 59 jobs posted | $2.1K total spent | $10.00 /hr avg hourly rate paid | Tech & IT | Member since Oct 26, 2020",
    "url": "https://www.upwork.com/jobs/Looking-for-NLP-Expert-Mentor-our-Junior-NLP-Developer_~021877270090493136276/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877270090493136276/apply/",
    "upwork_id": "021877270090493136276",
    "rate": "$10.00 - $12.00",
    "job_id": "021877270090493136276",
    "score": 3.0
  },
  "021877248439974169534": {
    "description": "We are seeking an experienced AI developer to create a web and desktop application that effectively detects Tuberculosis using JPEG and DICOM images. The ideal candidate should have a strong background in machine learning and image processing, with experience in medical imaging applications. You will work closely with our team to develop algorithms that can accurately analyze images and provide reliable diagnostics. If you have a passion for healthcare technology and are skilled in building AI-driven applications, we would love to hear from you.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "AI Developer Needed for Tuberculosis Detection Application",
    "client_infomation": "India Nashik 2:18 PM 25 jobs posted 20% hire rate, 4 open jobs $900 total spent 5 hires, 1 active Member since Feb 8, 2020 Payment method verified Rating is 5 out of 5.",
    "url": "https://www.upwork.com/jobs/Developer-Needed-for-Tuberculosis-Detection-Application_~021877248439974169534/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877248439974169534/apply/",
    "upwork_id": "021877248439974169534",
    "rate": "$500.00",
    "job_id": "021877248439974169534",
    "score": 4.0
  },
  "021877217481568750996": {
    "description": "I am seeking an experienced professional to configure and set up an AI-powered\nAssistant to streamline my daily workflows, including email management,\ncalendar scheduling, and task list automation. I am open to recommendations on\nthe best tools, platforms, and integrations to achieve this efficiently and\neffectively.",
    "duration": "< 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Assistant Development Using ChatGPT",
    "client_infomation": "United States, 12 jobs posted, $2K total spent, $37.86 /hr avg hourly rate paid",
    "url": "https://www.upwork.com/jobs/Assistant-Development-Using-ChatGPT_~021877217481568750996/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877217481568750996/apply/",
    "upwork_id": "021877217481568750996",
    "rate": "Bid range - High $65.00 | Avg $28.13 | Low $12.00",
    "job_id": "021877217481568750996",
    "score": 7.0
  },
  "021877197161059388350": {
    "description": "We are building an AI Agentic App that has extensive ML models. We have built\nthe MVP, which is now in production and has proven to be successful.\n\nHowever, there is still work to be done.  We are now building a fully workable\nproduct (this phase is kicking off now) which is the focus for Q1 2025\n\nYour role will be required to be hands-on in the entire AI architecture build\nand testing. You will also work with- two junior ML engineers, a senior data\nscientist, and a senior data engineer.\n\nWhat is expected?\nI am looking for someone who can spend at least 20 hours per week focussing on\nthe architecture buildout of AI applications with agentic capability,\nexperimentation and research (e.g. on langchain).\n\nYou must have:\n\\- Built AI agents and workflows\n\\- Have ML / Production experience\n\\- Launched products in the past\n\\- Built APIs\n\nPlease share your LinkedIn profile/Resume.",
    "duration": "2-3 month project. Targeted to end by latest Mar-end 2025.",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "LLM project - AI engineer (Canada only)",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/LLM-project-engineer-Canada-only_~021877197161059388350/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877197161059388350/apply/",
    "upwork_id": "021877197161059388350",
    "rate": "$2,500.00",
    "job_id": "021877197161059388350",
    "score": 9.0
  },
  "021877196916795504259": {
    "description": "We are seeking an experienced AI, ML, and Python developer to create a chatbot application that can engage users and provide intelligent responses. The ideal candidate will have a solid understanding of natural language processing (NLP) and machine learning algorithms. You will collaborate with our team to design, develop, and deploy the chatbot, ensuring it meets user interaction standards. Strong problem-solving skills and a passion for AI technology are essential for this role.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI, ML & Python Developer for Chatbot Application",
    "client_infomation": "India Delaware 2:19 PM 82 jobs posted 22% hire rate, 2 open jobs $2.9K total spent 18 hires, 5 active Tech & IT Mid-sized company (10-99 people) Member since Mar 25, 2021",
    "url": "https://www.upwork.com/jobs/Python-Developer-for-Chatbot-Application_~021877196916795504259/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877196916795504259/apply/",
    "upwork_id": "021877196916795504259",
    "rate": "Less than 30 hrs/week",
    "job_id": "021877196916795504259",
    "score": 8.0
  },
  "021877181762284620734": {
    "description": "Experienced AI engineer with expertise in integrating ChatGPT and Dialogflow for advanced conversational AI solutions.\n\nYou will be asked to answer the following questions when submitting a proposal:\n\n1. Describe your recent experience with similar projects \n2. What techniques would you use to clean a data set? \n3. What tools do you use for data mining and visualization? \n4. Please list any certifications related to this project",
    "duration": "Ongoing project",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "Expert AI Engineer",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Expert-Engineer_~021877181762284620734/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877181762284620734/apply/",
    "upwork_id": "021877181762284620734",
    "rate": "$2,500.00",
    "job_id": "021877181762284620734",
    "score": 7.0
  },
  "021877140420737043860": {
    "description": "We are seeking an experienced developer or AI specialist to create an advanced AI assistant that can interpret spoken instructions and dynamically update a task list form in real-time. The ideal candidate should have expertise in AI tools, natural language processing, and integration with task management platforms like Google Sheets or Notion.",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "AI Developer: Build a Voice-Activated Task Management Assistant",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Developer-Build-Voice-Activated-Task-Management-Assistant_~021877140420737043860/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877140420737043860/apply/",
    "upwork_id": "021877140420737043860",
    "rate": "$200.00",
    "job_id": "021877140420737043860",
    "score": 8.0
  },
  "021877087067940189827": {
    "description": "We are seeking a talented Machine Learning Specialist to join our team for a groundbreaking project. The ideal candidate will have experience in developing and implementing machine learning models, data analysis, and algorithm optimization. You will be responsible for data preprocessing, feature selection, and model evaluation. If you have a passion for AI and can translate complex data into actionable insights, we want to hear from you!",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Entry level",
    "job_type": "Hourly",
    "title": "Machine Learning Specialist Needed for Innovative Project",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Machine-Learning-Specialist-Needed-for-Innovative-Project_~021877087067940189827/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877087067940189827/apply/",
    "upwork_id": "021877087067940189827",
    "rate": "$40.00 - $70.00",
    "job_id": "021877087067940189827",
    "score": 5.0
  },
  "021877234045299206996": {
    "description": "Export Website to New Server and Website Issue Fixes to date. Pay a fixed price for your project.",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Pay a fixed price for your project",
    "client_infomation": "United States | Scottsdale | 1 job posted | 100% hire rate | $2.5K total spent | 4 hires | $20.00 /hr avg hourly rate paid | Member since Jul 26, 2023",
    "rate": "Bid range - High $95.00 | Avg $30.00 | Low $6.00",
    "url": "https://www.upwork.com/jobs/Pay-fixed-price-for-your-project_~021877234045299206996/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877234045299206996/apply/",
    "upwork_id": "021877234045299206996",
    "job_id": "021877234045299206996",
    "score": 2.0
  },
  "021877232965508861332": {
    "description": "Export Website to New Server and Website Issue Fixes",
    "duration": "Less than 1 month < 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Export Website to New Server and Website Issue Fixes",
    "client_infomation": "United States Scottsdale 1:55 AM 1 job posted 100% hire rate, 2 open jobs $2.5K total spent 4 hires, 1 active $20.00 /hr avg hourly rate paid 95 hours Individual client Member since Jul 26, 2023",
    "rate": "Bid range - High $95.00 | Avg $31.87 | Low $12.00",
    "url": "https://www.upwork.com/jobs/Export-Website-New-Server-and-Website-Issue-Fixes_~021877232965508861332/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877232965508861332/apply/",
    "upwork_id": "021877232965508861332",
    "job_id": "021877232965508861332",
    "score": 2.0
  },
  "021877210361641577300": {
    "description": "We are seeking a skilled developer to build an AI-powered outbound calling system. The system will automate outbound calls, manage conversations, and handle appointment bookings efficiently. This is a cost-conscious project designed for practical implementation.  \n  \nBudget and Timeline  \n* Budget: $25-$30 per hour  \n* Timeline: 1-2 weeks  \n* Experience Level: Intermediate to Expert  \n  \nKey Responsibilities  \n* Design and implement conversational flows for AI-powered outbound calls  \n* Configure voice recognition and text-to-speech functionalities  \n* Integrate the system with existing File Maker Pro from Claris  \n* Set up call tracking, analytics, and performance monitoring  \n  \nRequired Skills  \n* Proven experience in AI voice agent development  \n* Proficiency in Conversational AI and Natural Language Processing (NLP)  \n* Expertise in Twilio telephony integration  \n* Strong understanding of CRM system integration  \n* Exceptional problem-solving skills and attention to detail  \n  \nDeliverables  \n* Fully functional AI outbound calling system  \n* Documentation for system operation and maintenance  \n* Training materials for in-house management  \n  \n  \nApplication Guidelines  \nPlease include the following in your application:  \n1. Portfolio: Examples of similar AI voice agent or conversational AI projects.  \n2. Proposed Approach: Your plan for building an efficient and cost-effective system.  \n3. Timeline Estimation: Project duration and key milestones.  \n  \nThis is an exciting opportunity to create a cutting-edge AI solution for outbound sales calls. We look forward to seeing your innovative proposals!",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Outbound Call Agent Developer",
    "client_infomation": "Australia Sydney 7:55 PM 80 jobs posted 52% hire rate, 1 open job $11K total spent 43 hires, 4 active $4.53 /hr avg hourly rate paid 1,604 hours Sales & Marketing Small company (2-9 people) Member since Feb 19, 2010",
    "rate": "$25.00 - $35.00",
    "url": "https://www.upwork.com/jobs/Outbound-Call-Agent-Developer_~021877210361641577300/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877210361641577300/apply/",
    "upwork_id": "021877210361641577300",
    "job_id": "021877210361641577300",
    "score": 9.0
  },
  "021877030331112237908": {
    "description": "Are you a skilled AI professional new to Upwork and eager to showcase your expertise? We're a growing agency specializing in delivering cutting-edge solutions to our clients, and we're looking for a talented individual to join us for a long-term project.  \n  \nKey Skills We're Looking For:  \nMachine Learning (TensorFlow, PyTorch, or similar frameworks).  \nNatural Language Processing (NLP) for chatbots, sentiment analysis, or automated content generation.  \nComputer Vision for object detection, facial recognition, or image analysis.  \nAI-powered automation and API integration (e.g., OpenAI, Hugging Face).  \nData analysis and predictive modeling.  \nPrompt engineering and generative AI tools (e.g., ChatGPT, DALL·E, Stable Diffusion).  \nWhat We Offer:  \nA collaborative and supportive environment.  \nOpportunities to work on exciting, high-impact projects with real-world applications.  \nClear and consistent communication to ensure project success.  \nWhat We're Looking For in You:  \nA passion for solving complex problems with AI and delivering exceptional results.  \nStrong communication skills and attention to detail.  \nAvailability for regular check-ins and updates.  \nA willingness to grow with us and take on diverse challenges.  \nHow to Apply:  \nPlease include the following in your proposal:  \n  \nA brief introduction about yourself and your experience in AI.  \nExamples of previous work (GitHub repositories, case studies, or project descriptions are welcome).  \nA few sentences about why you're interested in a long-term collaboration.  \nIf you're ready to kickstart your Upwork journey and make an impact, we'd love to hear from you! 🌟",
    "duration": "6+ months",
    "experience_level": "Entry level",
    "job_type": "Hourly",
    "title": "Looking for a Talented AI Specialist for Long-Term Collaboration 🚀",
    "client_infomation": "Italy Genoa 9:56 AM 25 jobs posted 32% hire rate, 2 open jobs $177 total spent 8 hires, 1 active $7.00 /hr avg hourly rate paid 2 hours Member since Jun 21, 2024",
    "rate": "High $97.00 | Avg $31.20 | Low $6.00",
    "url": "https://www.upwork.com/jobs/Looking-for-Talented-Specialist-for-Long-Term-Collaboration_~021877030331112237908/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877030331112237908/apply/",
    "upwork_id": "021877030331112237908",
    "job_id": "021877030331112237908",
    "score": 7.0
  },
  "021877022180035655299": {
    "description": "I am looking for a developer with full stack skills and AI know-how.  \n  \nOur AI agent will be an extension, plugged on the client's data (his quoting\nsystem's API in most cases), and using a knowledge base that I will feed\n(pricing trainings + pricing policy of the company) to provide real-time\nadvice  to sales teams on the quotes they are working on.  \n  \nThe document attached explained the concept in more details with a mock-up.  \n  \nThe product will ideally based on convai.com technology (using their \"Indie\nDev\" pricing plan), or a similar company that provides animated avatars, as\nwell as an LLM model (the one provided by Convai or another one via an API).\nAlternatively, we may consider using a voice-only model using ElevenLabs (on\nwhich our project has been tested and works well).  \n  \nThe next step will be to launch a Proof Of Concept in February that will be a\nsimple version of the agent (voice + text enabled), for a compliance officer.\nIt will:  \n- be plugged on an offline data source (xls files)  \n- have a simple knowledge base (2-5 pages of text)  \n- enable the upload of a new quote to be assessed and reviewed  \n- provide guidance and answer user questions  \n- keep history log that will be used in the future by the agent for self\nimprovement  \n  \nWe are already discussing with other clients about full integration to a\npricing software or a BI tool, so we are looking for a long-term partner for\nthis mission.",
    "duration": "Less than 1 month < 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Skilled developer with",
    "client_infomation": "Payment method verified Phone number verified France 9:56 AM 1 job posted 0% hire rate, 1 open job Member since Apr 15, 2021",
    "rate": "Bid range - High $51.00 | Avg $28.71 | Low $20.00",
    "url": "https://www.upwork.com/jobs/Skilled-developer-with_~021877022180035655299/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877022180035655299/apply/",
    "upwork_id": "021877022180035655299",
    "job_id": "021877022180035655299",
    "score": 8.0
  },
  "021877013070116621246": {
    "description": "We’re looking for a Full-Stack Developer to lead the technical development of our education platform focused on crypto and trading. This role will define the roadmap, structure, and solutions to build an efficient, scalable product.  \n  \nRequirements:  \n  \n- Frontend & Backend: Expert in Next.js and Node.js.  \n- API Integration: Skilled in blockchain and crypto API development.  \n- Automation: Able to create automated systems for seamless user experience.  \n- Scalable Solutions: Designs structures that are scalable and easy to maintain.  \n- experience in setting roadmaps and technical strategy.  \n- Crypto & Trading: Familiarity with crypto and trading platforms is a plus.  \n  \nPlease begin your application with deadline of the proejct and pricning as we work on fix price projec not hourly !",
    "duration": "Ongoing project",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "Full-Stack web Developer",
    "client_infomation": "nan",
    "rate": "$1,000.00  Fixed-price I am willing to pay higher rates for the most experienced freelancers",
    "url": "https://www.upwork.com/jobs/Full-Stack-web-Developer_~021877013070116621246/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877013070116621246/apply/",
    "upwork_id": "021877013070116621246",
    "job_id": "021877013070116621246",
    "score": 8.0
  },
  "021877001459313115041": {
    "description": "We are looking for an experienced developer to create a powerful, user-friendly application that integrates Google Sheets with AI-driven financial analysis tools. This app should be designed for use by accountants and financial professionals, offering seamless analysis and insights directly within Google Sheets.  \n  \nKey Responsibilities:  \n• Develop a Google Sheets-based app using Apps Script or related technologies.  \n• Integrate AI tools (such as OpenAI API or similar) to perform financial analysis tasks, including trend analysis, forecasting, and key metric calculations.  \n• Automate data manipulation, visualization, and reporting within Google Sheets.  \n• Create an intuitive and easy-to-use interface for financial professionals.  \n• Ensure the app is secure, scalable, and compatible with multiple Google accounts.  \n• Provide documentation and training materials for end users.  \n  \nRequired Skills:  \n• Expertise in Google Apps Script, Google Sheets API, and related technologies.  \n• Experience integrating AI tools (e.g., OpenAI, Google AI) into applications.  \n• Strong understanding of financial analysis concepts, including cash flow analysis, budgeting, and forecasting.  \n• Proficiency in JavaScript, Python, or other relevant programming languages.  \n• Experience with data visualization tools within Google Sheets (e.g., custom charts, dashboards).  \n• Familiarity with APIs and third-party integrations.  \n• Strong problem-solving skills and attention to detail.  \n  \nPreferred Skills:  \n• Experience in accounting or finance.  \n• Knowledge of machine learning or natural language processing (NLP) as applied to financial data.  \n• Background in creating add-ons for Google Workspace or similar ecosystems.  \n  \nDeliverables:  \n• A fully functioning Google Sheets app with integrated AI features for financial analysis.  \n• User guide/documentation for app setup and functionality.  \n• Ongoing support for bug fixes and updates (optional).  \n  \nProject Scope:  \n  \nPlease include in your proposal:  \n1. A brief description of your experience with similar projects.  \n2. Examples of previous work integrating Google Sheets and AI.  \n3. A rough timeline and cost estimate for this project.  \n  \nWe are excited to work with someone who can bring creative ideas and technical expertise to this project. If you have the skills and vision to build a next-generation tool for financial professionals, we’d love to hear from you!",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "App Developer for Google Sheets + AI Integration for Financial Analysis",
    "client_infomation": "United States Santa Monica 12:57 AM 6 jobs posted 84% hire rate, 1 open job $847 total spent 5 hires, 2 active $6.52 /hr avg hourly rate paid 114 hours Education Small company (2-9 people) Member since Sep 8, 2023",
    "rate": "$11.00 - $25.00",
    "url": "https://www.upwork.com/jobs/App-Developer-for-Google-Sheets-Integration-for-Financial-Analysis_~021877001459313115041/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877001459313115041/apply/",
    "upwork_id": "021877001459313115041",
    "job_id": "021877001459313115041",
    "score": 6.0
  },
  "021876922798929999491": {
    "description": "A previous developer helped me build an AI voice agent in VAPI and n8n.  \n  \nThe agent currently takes inbound calls like a receptionist. The agent responds to callers giving business information, pricing and FAQs. It also sets appointments by looking at a calendar (already setup) and suggests available times.  \n  \nCurrent tech stack  \nGCP - google calendar  \nN8n - workflows  \nVAPI - voice AI  \nOpenAI - chat summarisation  \nTwilio - phone number  \n  \nWe are stuck on a Stripe implementation where the agent sends a payment link (eg via email or SMS) to the caller to make a payment to confirm the appointment. Need support specifically in completing this part of the flow.  \n  \nSo the flow should be  \n1. Caller rings number  \n2.  AI agent answers and provides business information, and offers to  set up an appointment   \n3. Callers asks availability on certain days  \n4. agent checks calendar and confirms or proposes alternative times  \n5. Caller agree on time, agent books the appointment and sends calendar\ninvite and confirms booking over phone, then politely ends call.  \n  \n  \nAdditional step to be added  \n- before step 5 above, Agent asks caller for email address to send a payment\nlink (stripe)  \n- after caller completes payment - agent checks for payment confirmation. If\nconfirmed, agent tells caller that the payment is successful and then we move\nto step 5 above.  \n- If payment unsuccessful, it tells caller that it was unsuccessful and asks\nto try again. If still unsuccessful, it tells caller that the appointment is\nnot confirmed and that we will pass on to someone who will call back to take\npayment over the phone.  \n  \nThis should be a quick integration as it is testing the flow and stripe\nintegration. We have done most of the work and requires an experienced AI\nagent to complete.  \n  \nThis must be completed by Friday this week.",
    "duration": "One-time project",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "N8n VAPI Stripe - integration support",
    "client_infomation": "nan",
    "rate": "$50.00",
    "url": "https://www.upwork.com/jobs/N8n-VAPI-Stripe-integration-support_~021876922798929999491/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876922798929999491/apply/",
    "upwork_id": "021876922798929999491",
    "job_id": "021876922798929999491",
    "score": 7.0
  },
  "021876909175860039060": {
    "description": "We are looking to build an AI-powered classroom website for teachers, very similar in functionality to Google Classroom except this will include AI chat tasks that are graded.  \n  \nThe website will allow teachers to create and manage multiple classrooms for different subjects. In each classroom, the teacher can upload educational content in the form of PDF files to serve as modules. Students can access and complete tasks.  \n  \nFeatures:  \n  \n    Teachers can create modules and upload PDF files with relevant content.  \n    Teachers can set instructions for the AI bot (e.g., \"10 questions a day on addition\").  \n    Students log into their profiles daily, select the module, and interact with the AI chatbot.  \n    The AI bot will present 10 questions, and when the student answers correctly, it will proceed to the next question. If the student answers incorrectly, the bot will explain the mistake and allow the student to ask questions before moving forward.  \n    At the end of the 10 questions, the AI bot records the student’s score, which is saved in a gradebook similar to Google Classroom.  \n    The platform tracks the student’s overall progress and grades across multiple modules (e.g., Addition, Subtraction, Multiplication, Division for math).  \n  \nTeacher’s Dashboard:  \n  \n    Teachers can monitor student progress, view grades, and track the completion of modules.  \n    Teachers can create different classrooms for various subjects and upload multiple modules for each.  \n  \nAdditional Requirement: The website should be designed with future mobile app\nintegration in mind. We plan to transition the platform into a mobile app\n(iOS) via the App Store at a later point, allowing students to easily access\nand complete their modules on their phones. Please design the site with this\nscalability in mind.  \n  \nRequirements:  \n  \n    Experience in building interactive web platforms with AI integration.  \n    Familiarity with building gradebook systems and dashboards for educators.  \n    Experience with chatbot development and AI-powered learning tools.  \n    WordPress is the preferred platform for this project. We are looking for a developer who is experienced with WordPress and its plugins. Please include suggestions for any plugins you would consider using to build the site.  \n  \nTo Be Considered: If you are interested in this project, please submit a proof\nof concept. This could include any past AI-integrated projects (student,\nteacher, or user group projects, etc.) and a clear plan for how you would\nexecute this project. Please include details on the plugins you would use, how\nyou would integrate the AI functionality, and any tools or technologies you\nwould recommend for this build.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "AI Classroom Website Developer",
    "client_infomation": "Singapore 4:58 PM 96 jobs posted 59% hire rate, 5 open jobs $1.3K total spent 65 hires, 14 active Member since Jul 28, 2023",
    "rate": "$500.00",
    "url": "https://www.upwork.com/jobs/Classroom-Website-Developer_~021876909175860039060/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876909175860039060/apply/",
    "upwork_id": "021876909175860039060",
    "job_id": "021876909175860039060",
    "score": 7.0
  },
  "021876871102963357584": {
    "description": "Need someone to build a customer churn model using ML, I have the data of millions of customers, which I would like to use in order to predict the retention of customers for a brand. If you have any experience with such work, please apply to the job and attach your relevant portfolio.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Customer Churn ML Model",
    "client_infomation": "nan",
    "rate": "$200.00",
    "url": "https://www.upwork.com/jobs/Customer-Churn-Model_~021876871102963357584/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876871102963357584/apply/",
    "upwork_id": "021876871102963357584",
    "job_id": "021876871102963357584",
    "score": 7.0
  },
  "021877279865138253204": {
    "description": "We’re looking for a fractional specialist to lead and shape an innovative project centered on LLM (Large Language Models) and AI-powered solutions. This is not just a hands-on technical role—you’ll also play a key part in building and leading a team while collaborating closely with stakeholders.\n:magnifying_glass: Key Qualifications and Skills:  \nExpertise in LLMs (e.g., OpenAI, Hugging Face) and practical AI applications.  \nAdvanced proficiency in Python and JavaScript—key for developing and integrating solutions.  \nProven ability to fine-tune, deploy, and optimize AI systems at scale.  \nStrong communication and leadership skills, with the ability to effectively work with business owners  \nExperience in team building and management—you’ll be responsible for assembling a capable team.  \nBackground as a CTO, technical manager, or similar leadership role is highly preferred.  \n  \nPlease reach out if you are interedted!",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Hiring: Fractional Specialist in LLM AI-Powered Solutions!",
    "client_infomation": "Ukraine Lviv 11:04 AM 10 jobs posted 60% hire rate, 3 open jobs $3.9K total spent 6 hires, 2 active $63.64 /hr avg hourly rate paid 40 hours Real Estate Mid-sized company (10-99 people) Member since Apr 10, 2024",
    "rate": "I am willing to pay higher rates for the most experienced freelancers",
    "url": "https://www.upwork.com/jobs/Hiring-Fractional-Specialist-LLM-Powered-Solutions_~021877279865138253204/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877279865138253204/apply/",
    "upwork_id": "021877279865138253204",
    "job_id": "021877279865138253204",
    "score": 9.0
  },
  "021877253978800270164": {
    "description": "We are seeking a talented freelancer to use Chatgpt to create detailed\nwhiteboard video scenarios that effectively accompanied by engaging visuals\nand voiceover text It can be done in less than 5 minutes using ChatGPT, you\njust need to ask ChatGPT and we will show you how to do it.\n\nAlso you need to use AI tools to create Voiceover MP3 files (we can guide you\nhow to do it). Google Cloud provides some free Voiceover functionality, you\njust simply put the text there and Google Cloud (GCP) comes up with the\nVoiceOver MP3 files, so you will need to create an account on Google Cloud.\n\nWe are planning to create several scenarios over the next 12 months. Since\nwe're just starting and have no income yet from these videos, we need to keep\ncosts low. If you can deliver quality animations at a reasonable price, I’d\nlove to work with you! the budget we have in mind for every 5 videos inlcuidng\nscenario and the Voiceover files is 5$ so if you are happy with that offer\nplease apply. We can revisit the budget and the contract fee after a few\nweeks.\n\nPlease DO NOT apply if you are NOT happy with 5$ offer for every 5 videos.\nThanks.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Admin work using Chatgpt",
    "client_infomation": "nan",
    "rate": "$3,000.00",
    "url": "https://www.upwork.com/jobs/Admin-work-using-Chatgpt_~021877253978800270164/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877253978800270164/apply/",
    "upwork_id": "021877253978800270164",
    "job_id": "021877253978800270164",
    "score": 1.0
  },
  "021877185814385142612": {
    "description": "We’re building an AI-powered SaaS platform aimed at revolutionizing healthcare communication. Our goal is to create a real-time speech-to-text, text-to-speech, and live language translation system tailored specifically for medical environments. This system must be able to handle multiple languages, be extremely accurate in its translations, and operate seamlessly in real-time, ensuring it can be used in high-stress situations without errors. One of our key challenges is ensuring voice differentiation based on context — for instance, the system should automatically detect whether it's a male or female speaker and adjust the voice accordingly. We also need the platform to provide natural-sounding speech outputs, so the voice feels human and approachable, particularly in high-stress healthcare settings where patient comfort and trust are critical. We’re also very focused on making sure the system’s output is clear and easy to understand in emergency scenarios. The system must adhere to the strictest privacy standards and comply with GDPR regulations, as we will be handling sensitive patient data. We need someone with experience in building secure, scalable platforms with a deep understanding of AI, natural language processing, and large language models like GPT, as well as real-time data processing. Ideally, you’ll also have experience integrating APIs, working with cloud services, and ensuring smooth interactions between text, voice, and various languages in real-time. You should be comfortable working with both frontend and backend technologies, have a strong grasp of SaaS development, and be capable of collaborating with a team to deliver timely, high-quality work. We value innovation and are looking for a partner who’s excited about the opportunity to push boundaries in healthcare technology. We also need someone who understands the importance of accuracy, reliability, and empathy when it comes to medical communication, as this could significantly impact the quality of care that the patients receive. This is a chance to join a project with a huge potential for positive impact on millions of people around the world. If you’re passionate about AI, healthcare, and solving real-world problems, we’d love to have you on board. Let’s work together to build something that can truly make a difference in the lives of patients and healthcare professionals everywhere. Thank you.",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Full Stack Developer for AI-Driven Multilingual Healthcare Communication Platform",
    "client_infomation": "Denmark | 1 job posted | 0% hire rate, 1 open job | Member since Jan 9, 2025 | Payment method not verified | Phone number verified",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Full-Stack-Developer-for-Driven-Multilingual-Healthcare-Communication-Platform_~021877185814385142612/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877185814385142612/apply/",
    "upwork_id": "021877185814385142612",
    "job_id": "021877185814385142612",
    "score": 8.0
  },
  "021877177462926093140": {
    "description": "Need someone to organize my digital world.  Organize my chat gpt conversations  Organize my YouTube videos saved in watch later  Organize my Instagram saved posts.  Distill the information into helpful key actionable notes 📝  Person needs to have high privacy concerns and protect my information and data with great sensitivity and care. Need someone who will not judge me and is very polite and understanding. Also need a great communicator.",
    "duration": "Less than 1 month < 1 month",
    "experience_level": "Entry level",
    "job_type": "Hourly",
    "title": "Organize information for me",
    "client_infomation": "nan",
    "rate": "$3.00",
    "url": "https://www.upwork.com/jobs/Organize-information-for_~021877177462926093140/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877177462926093140/apply/",
    "upwork_id": "021877177462926093140",
    "job_id": "021877177462926093140",
    "score": 1.0
  },
  "021877157738477529940": {
    "description": "We are a dynamic and fast-paced company seeking an experienced and resourceful\nExecutive Assistant with specialized expertise in managing frequent flyer\nprograms and maximizing travel rewards. Our goal is to optimize travel costs,\ncapitalize on rewards programs, and streamline travel planning for business\nand personal purposes.\n  \nIf you are adept at uncovering rewards opportunities and enjoy navigating\nloyalty programs, we’d love to have you on our team!\n  \nKey Responsibilities:  \nFrequent Flyer Account Management:  \n  \nManage, organize, and optimize frequent flyer accounts across multiple\nairlines.  \nKeep track of mileage expiration dates and ensure timely utilization or\nextensions.  \nAward Maximization:  \n  \nResearch and book award flights and accommodations to ensure maximum value.  \nStay updated on changes in loyalty programs, point valuation, and redemption\noptions.  \nIdentify opportunities to transfer or combine points to maximize rewards.  \nTravel Hacking:  \n  \nImplement strategies to maximize travel points through credit card offers,\nairline alliances, and promotions.  \nMonitor and take advantage of flash sales, mileage bonuses, and point\nmultipliers.  \nTravel Planning:  \n  \nPlan and coordinate domestic and international travel itineraries for business\nand personal needs.  \nOptimize travel routes and fares to ensure cost-efficiency and convenience.  \nReporting and Tracking:  \n  \nProvide regular reports on point balances, redemptions, and travel savings\nachieved.  \nMaintain an organized database of loyalty programs, account credentials, and\nactivity history.  \nIndustry Monitoring:  \n  \nFollow and report on trends, hacks, and news related to frequent flyer\nprograms and travel rewards.  \nCollaborate with the team to ensure that the company stays ahead of changes in\ntravel loyalty programs.  \n  \nQualifications:  \nExperience:  \n  \nAt least 2+ years of experience managing frequent flyer accounts or working in\na related role.  \nProven expertise in travel hacking and maximizing loyalty rewards.  \nSkills:  \n  \nStrong organizational and time-management skills.  \nExcellent research and analytical capabilities.  \nProficient in using online travel tools, loyalty platforms, and flight booking\nsystems.  \nKnowledge:  \n  \nIn-depth understanding of major airline loyalty programs (e.g., Delta\nSkyMiles, American AAdvantage, United MileagePlus).  \nFamiliarity with hotel rewards programs (e.g., Marriott Bonvoy, Hilton Honors)\nand credit card rewards systems.  \nAttributes:  \n  \nResourceful, detail-oriented, and highly motivated.  \nPassionate about travel and consistently looking for creative ways to optimize\nresources.  \nComfortable working remotely and independently.",
    "duration": "6+ months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Executive Assistant - Travel Program and Reward Specialist",
    "client_infomation": "nan",
    "rate": "$7.00 - $20.00/hr",
    "url": "https://www.upwork.com/jobs/Executive-Assistant-Travel-Program-and-Reward-Specialist_~021877157738477529940/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877157738477529940/apply/",
    "upwork_id": "021877157738477529940",
    "job_id": "021877157738477529940",
    "score": 2.0
  },
  "021877129009872965012": {
    "description": "I would like to develop an AI-powered application that generates top-tier business proposals, plans, sales letters, marketing campaigns, and comprehensive marketing funnels at the press of a button.  \n  \nProject Requirements  \n  \nScope: The app must have the ability to generate various business documents and marketing materials using AI.  \nTechnology Stack:  AI models like GPT-4, programming languages, and frameworks.  \nUser Interface: Design an intuitive and user-friendly interface that allows users to input data and receive generated content seamlessly.  \n  \nPlease let me know if you can help with this and rough cost estimate.  \n  \nRegards  \n  \nBrendan (Startup)  \np.s. partnership opportunities available.",
    "duration": "Less than 1 month < 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Business Platform",
    "client_infomation": "United Kingdom Milton Keynes 9:06 AM 2 jobs posted 0% hire rate, 1 open job HR & Business Services Individual client Member since Aug 1, 2012",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Business-Platform_~021877129009872965012/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877129009872965012/apply/",
    "upwork_id": "021877129009872965012",
    "job_id": "021877129009872965012",
    "score": 8.0
  },
  "021877122679732827779": {
    "description": "Will work in research, keywords, google doc, canva, should be tech savvy.",
    "duration": "Ongoing project",
    "experience_level": "Entry level",
    "job_type": "Fixed",
    "title": "Virtual assistant",
    "client_infomation": "nan",
    "rate": "$130.00",
    "url": "https://www.upwork.com/jobs/Virtual-assistant_~021877122679732827779/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877122679732827779/apply/",
    "upwork_id": "021877122679732827779",
    "job_id": "021877122679732827779",
    "score": 2.0
  },
  "021877122362488625040": {
    "description": "We are looking for a talented Full-Stack Content Creator who excels in photo editing, Shopify web design, and digital marketing. In this role, you'll create engaging visuals, design an effective e-commerce experience, and implement marketing strategies that drive traffic and boost sales. If you're a creative thinker with a passion for content creation and a proven track record in these areas, we want to hear from you. Join our team and help us elevate our online presence!",
    "duration": "More than 6 months 6+ months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Full-Stack Content Creator Needed for Shopify and Marketing",
    "client_infomation": "nan",
    "rate": "$8.00 - $35.00 Hourly",
    "url": "https://www.upwork.com/jobs/Full-Stack-Content-Creator-Needed-for-Shopify-and-Marketing_~021877122362488625040/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877122362488625040/apply/",
    "upwork_id": "021877122362488625040",
    "job_id": "021877122362488625040",
    "score": 3.0
  },
  "021877226104852182659": {
    "description": "I want a  full stack, batteries-included framework to build SAAS based Hybrid\nMobile Applications.  \nFor Reference you can look up frappe framework.  \nPossible Tech Stack  \nBackend - Litestar  \nDB - Postgres  \nFrontend - React Native / Flutter  \nAPI Gateway  \nApplication - will be used to create business applications like CRM , Inventory Management , etc.  \nDeliverables - Framework and CRM app  \nWe will provide Figma designs.  \nTimeline - 15 days  \nBudget - 3000 USD",
    "duration": "15 days",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "A full stack, batteries-included framework to build SAAS based Hybrid\nMobile Applications",
    "client_infomation": "nan",
    "rate": "$3,000.00",
    "url": "https://www.upwork.com/jobs/full-stack-batteries-included-framework-build-SAAS-based-Hybrid-Mobile-Applications_~021877226104852182659/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877226104852182659/apply/",
    "upwork_id": "021877226104852182659",
    "job_id": "021877226104852182659",
    "score": 6.0
  },
  "021877064458678766996": {
    "description": "We are seeking a skilled professional to assist in setting up a Langflow environment on our server. The ideal candidate will have experience in configuring Langflow and will be able to establish basic agent workflows tailored to our requirements. This is a critical role that involves both technical expertise and the ability to provide clear guidance throughout the setup process. If you are proficient in server management and workflow automation, we would love to hear from you!",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Langflow Environment Setup and Agent Workflow Configuration",
    "client_infomation": "nan",
    "rate": "$10.00 - $20.00 Hourly",
    "url": "https://www.upwork.com/jobs/Langflow-Environment-Setup-and-Agent-Workflow-Configuration_~021877064458678766996/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877064458678766996/apply/",
    "upwork_id": "021877064458678766996",
    "job_id": "021877064458678766996",
    "score": 7.0
  },
  "021877063349847324291": {
    "description": "We are seeking an experienced mentor to guide our team in navigating agentic frameworks, specifically Creai Langchain and Langgraph. The ideal candidate will provide insights, best practices, and hands-on support to enhance our understanding and application of these frameworks. Your expertise will play a crucial role in helping us leverage these technologies effectively. If you have a strong background in agentic frameworks and a passion for mentoring, we would love to hear from you.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Mentor for Agentic Frameworks (Creai Langchain, Langgraph, etc.)",
    "client_infomation": "nan",
    "rate": "$18.00 - $25.00 Hourly",
    "url": "https://www.upwork.com/jobs/Mentor-for-Agentic-Frameworks-Creai-Langchain-Langgraph-etc_~021877063349847324291/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877063349847324291/apply/",
    "upwork_id": "021877063349847324291",
    "job_id": "021877063349847324291",
    "score": 9.0
  },
  "021866190984237591791": {
    "description": "We are a fast-growing startup at the forefront of AI and fintech innovation. Our mission is to revolutionize document management for companies, investors, and financial services, helping them optimize due diligence, compliance, and document automation. As a senior team member, you’ll have the opportunity to lead critical backend and AI initiatives, directly shaping how we redefine a trillion-dollar industry with cutting-edge AI solutions.\n  \nWhat You’ll Do:  \n  \nAs a Senior Backend Data Scientist with AI Focus, you’ll play a pivotal role in developing the backend systems and integrating advanced AI models into our platform. Your responsibilities include:  \n  \n-Backend Development:  \n--Build and maintain scalable, secure APIs using Python and Flask.  \n--Design and optimize database structures with a focus on MongoDB.  \n--Ensure the performance and scalability of backend systems for AI applications.  \n  \n-AI Integration:  \n--Work with pre-trained models (e.g., LLMs) to fine-tune and integrate them into production systems.  \n--Experiment with and test AI models from libraries such as TensorFlow, PyTorch, Hugging Face, and LangChain.  \n--Develop workflows to validate, evaluate, and enhance AI-driven solutions.  \n  \n-Future Deployment:  \n--Collaborate on MLOps practices to manage the lifecycle of AI models.  \n--Potentially lead efforts to deploy custom-trained models in production systems.  \n  \nWhat You Bring:  \n  \n-Must-Have Skills:  \n--Strong expertise in Python programming and backend frameworks like Flask.  \n--Experience designing efficient database architectures with MongoDB.  \n--Extensive knowledge of AI and machine learning libraries, including TensorFlow, PyTorch, Hugging Face, and LangChain.  \n--Proven ability to work with large language models (LLMs) and fine-tune them for specific use cases.  \n  \n-Bonus Points:  \n--Hands-on experience with MLOps tools and practices, such as model monitoring and versioning.  \n--Familiarity with AutoML tools for model selection and hyperparameter tuning.  \n--Advanced Natural Language Processing (NLP) expertise (e.g., GPT, BERT).  \n  \n-Soft Skills:  \n--Strong analytical and problem-solving mindset.  \n--Proven ability to take ownership of projects and drive them to completion.  \n--Adaptability to a fast-changing, dynamic startup environment.  \n--Ability to work remotely with partial timezone overlap for collaboration.  \n  \nWhy Join Us?  \n-Fully remote, work-from-anywhere culture.  \n-Flexible hours with a supportive and collaborative -team.  \n-Leadership opportunities in shaping cutting-edge AI products at a high-growth startup.",
    "duration": "More than 6 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Senior Backend Data Scientist with AI Focus",
    "client_infomation": "nan",
    "rate": "$20.00 - $55.00/hr",
    "url": "https://www.upwork.com/jobs/Senior-Backend-Data-Scientist-with-Focus_~021866190984237591791/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021866190984237591791/apply/",
    "upwork_id": "021866190984237591791",
    "job_id": "021866190984237591791",
    "score": 8.0
  },
  "021876987075330583380": {
    "description": "We are looking for a skilled developer to assist in building a Large Language Model (LLM) application with Retrieval-Augmented Generation (RAG) implementation. The frontend is supposed to be developed with streamlit. The ideal candidate will have experience in developing AI applications and a solid understanding of RAG methodologies. You will work closely with our team to design, prototype, and implement features that leverage LLM capabilities. Your contributions will be pivotal in enhancing the application’s performance and user experience. If you are passionate about AI and have a strong technical background, we would love to hear from you!",
    "duration": "Less than 1 month < 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "LLM Application Development with RAG Implementation",
    "client_infomation": "Germany | 1 job posted | 0% hire rate, 1 open job | Engineering & Architecture | Individual client | Member since Jan 8, 2025",
    "rate": "$15.00 - $42.00/hour",
    "url": "https://www.upwork.com/jobs/LLM-Application-Development-with-RAG-Implementation_~021876987075330583380/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876987075330583380/apply/",
    "upwork_id": "021876987075330583380",
    "job_id": "021876987075330583380",
    "score": 7.0
  },
  "021876639578209653759": {
    "description": "We have a rudimentary finance chat application built on ChatGPT.  We’re seeking a developer to optimize the code by eliminating redundancies, improving response times, and enhancing the quality of outputs.  Additionally, we need to implement new endpoint integrations, including potential support for XAI, and update the front-end code to fix and refine UI elements.  We are looking for a developer with a strong understanding of machine learning and the ability to write highly efficient code.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Updates and Fixes for Finance AI chat application",
    "client_infomation": "Nigeria Lagos 10:11 AM 19 jobs posted 74% hire rate, 1 open job $4.5K total spent 15 hires, 0 active Mid-sized company (10-99 people) Member since Dec 1, 2017",
    "rate": "Bid range - High $150.00 | Avg $37.91 | Low $10.00",
    "url": "https://www.upwork.com/jobs/Updates-and-Fixes-for-Finance-chat-application_~021876639578209653759/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876639578209653759/apply/",
    "upwork_id": "021876639578209653759",
    "job_id": "021876639578209653759",
    "score": 8.0
  },
  "021876619913831131988": {
    "description": "We are seeking a skilled Machine Learning Engineer - MUST BE US BASED -  AND\nMUST SIGN AN NDA - with expertise in Retrieval-Augmented Generation (RAG)\narchitecture to join our team. The successful candidate will contribute to the\ndevelopment of a cutting-edge AI system, including backend ML pipeline\noptimization and integration into the overall product. This role will also\ninvolve working closely with stakeholders and the front-end team to align\ntechnical implementations with business requirements.  \n  \nKey Responsibilities:  \n  \nDevelop and implement RAG architecture for scalable and accurate information\nretrieval and augmentation.  \nBuild and fine-tune models for knowledge extraction, query understanding, and\nresponse generation.  \nIntegrate ML pipelines with external data sources and internal databases to\nensure seamless interaction.  \nCollaborate with cross-functional teams to align ML solutions with business\nobjectives.  \nOptimize ML models for performance, scalability, and efficiency in a\nproduction environment.  \nAnalyze and process large datasets to derive meaningful insights and train AI\nmodels.  \nCreate and maintain documentation for all ML processes, from training to\ndeployment.  \nContribute to the deployment and monitoring of ML models to ensure continuous\nperformance improvement.  \nStay updated with the latest developments in machine learning, particularly\nRAG frameworks.  \n  \nQualifications:  \n  \nProven experience in developing Retrieval-Augmented Generation (RAG) solutions\nor similar architectures.  \nStrong expertise in NLP techniques, transformer-based models (e.g., GPT,\nBERT), and vector databases.  \nExperience with tools like LangChain, FAISS, Pinecone, or similar vector-based\nretrieval systems.  \nProficient in Python and ML frameworks such as TensorFlow, PyTorch, or Hugging\nFace.  \nSolid understanding of data preprocessing, feature engineering, and model\noptimization techniques.  \nFamiliarity with deploying ML models on cloud platforms (AWS, Azure, or GCP).  \nStrong problem-solving skills with attention to detail and the ability to work\nindependently.  \n  \nPreferred Skills:  \n  \nKnowledge of front-end integration for ML-driven features.  \nExperience in working within agile environments and delivering on tight\ntimelines.  \nUnderstanding of knowledge bases and document indexing.",
    "duration": "1 to 3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Machine Learning Engineer (RAG Architecture) - MUST BE USA BASED",
    "client_infomation": "United States New York 6:11 AM 88 jobs posted 3% hire rate, 2 open jobs $83 total spent 2 hires, 1 active $125.00 /hr avg hourly rate paid 1 hour Member since Oct 15, 2016",
    "rate": "$30.00 - $60.00",
    "url": "https://www.upwork.com/jobs/Machine-Learning-Engineer-RAG-Architecture-MUST-USA-BASED_~021876619913831131988/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876619913831131988/apply/",
    "upwork_id": "021876619913831131988",
    "job_id": "021876619913831131988",
    "score": 8.0
  },
  "021877254651415432126": {
    "description": "We’re a high-production content agency seeking an experienced AI Developer or team to build multiple specialized bots to optimize our entire content creation process. These bots will handle everything from creative direction and planning to distribution, engagement, and analytics. Each bot must be integrated into a cohesive workflow, with human managers (e.g., Creative Director, Operations Manager) overseeing and refining their output.  What We Need  1. Vision & Creative Direction Bots - Shape overall creative vision and brand voice, propose content ideas.  2. Content Planning & Alignment Bots - Create content calendars, ensure strategies align with business objectives.  3. Logistics & Resource Management Bots - Handle scheduling, resource allocation, and coordination of multiple projects.  4. Content Production Bots - Assist writers, videographers, photographers, and designers with AI-driven suggestions and draft content.  5. Quality Assurance & Editing Bots - Monitor grammar, style, brand consistency, and suggest improvements.  6. Distribution & Engagement Bots - Post content across platforms, track engagement metrics, recommend engagement tactics.  7. Analytics & AI Tool Management Bots - Implement AI tools, compile performance data, provide insights for ongoing strategy adjustments.  Responsibilities  1. Identify and select the most suitable Large Language Models (LLMs) for each task (e.g., GPT-4, open-source models).  2. Design effective workflows where multiple bots collaborate seamlessly.  3. Provide clear documentation to enable efficient bot management and refinement.  4. Conduct testing and iterations to optimize the bots’ performance and accuracy.  Deliverables  1. System Architecture - A blueprint depicting how all bots interact with each other and with human oversight.  2. AI Bot Development & Integration - Robust, specialized bots for each designated workflow area, integrated into relevant software tools.  3. Workflow Documentation - Detailed SOPs and best practices for setup, use, troubleshooting, and maintenance.  4. Testing & Iteration - Beta launches to validate performance, plus refinements based on feedback.  5. Deployment & Handover - Final rollout of all bots, along with training sessions for staff on usage and process management.  If you have experience designing AI-driven solutions and are ready to shape the backbone of a large-scale content operation, we’d love to hear from you.",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "AI Agent Development for High-Production Content Agency",
    "client_infomation": "Payment method not verified. Phone number verified. Australia 8:16 PM 0% hire rate, 1 open job Tech & IT Small company (2-9 people) Member since Jan 9, 2025",
    "url": "https://www.upwork.com/jobs/Agent-Development-for-High-Production-Content-Agency_~021877254651415432126/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877254651415432126/apply/",
    "upwork_id": "021877254651415432126",
    "rate": "nan",
    "job_id": "021877254651415432126",
    "score": 9.0
  },
  "021877113551090625364": {
    "description": "Need an AI Agent building expert that also knows GHL very well. I would like to have a REAL sounding cold calling agent with no latency to call through our data list.  I would like the AI agent / dialer to use my list within GHL and then disposition the leads that are not interested, already has solar, booked appointment and add the appropriate tags so that the leads can be routed throughout the pipeline. IF it books an appointment it needs to also book it on the GHL calendar as well and use the availability in the call based on the availability in the GHL calendar.  I have been in marketing for 10 years and did Google ads, facebook ads etc and sold leads to many solar salesman and companies over the years but that market is very saturated and not very profitable anymore. I am willing to partner with you to build out a very successful campaign and prove that it works with the data i have to prove the model and gather enough data to bring to my previous clients and sales organizations.",
    "duration": "Ongoing project",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "Build an outgoing cold calling AI agent for Solar industry",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Build-outgoing-cold-calling-agent-for-Solar-industry_~021877113551090625364/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877113551090625364/apply/",
    "upwork_id": "021877113551090625364",
    "rate": "$400.00",
    "job_id": "021877113551090625364",
    "score": 8.0
  },
  "021877091982960036798": {
    "description": "I'm looking for a Taskade or any Ai agent builder that can create a few different automations.  \n  \nAutomations that I'm looking to have created:  \n1. SOCIAL MEDIA SCRIPT AND VIDEO CREATION - An automated routine that creates an ai-developed script based on my products I sell, runs it through an ai voice generator (with my voice), and then creates a social media video. Ideally, the video would show me for the first few seconds and then go to generic videos.  \n2. LINKEDIN POSTING - An automation that pulls relevant topics for my role, creates the LinkedIn post, and then posts it to my LinkedIn.  \n3. BLOG CREATION AND POSTING - Ai creation of blogs and posting it automatically.  \n  \nOthers that would be awesome:  \n1. UGC Creation - Ai based UGC that I can post to my socials.  \n2. LIFESTYLE/PRODUCT IMAGERY - Ai based imagery for my two businesses. The imagery needs to look quality and not have errors.  \n3. WEEKLY MEAL PLANNING - I'd like to tell an agent all the food in my kitchen and it remember. Every week, it then asks for my preferences for meals/diets/etc., creates meal recommendations. Once aligned on the meals, it builds a grocery list (factoring in my current groceries), so the list only includes what we need to buy. We then can take an image of our receipts and those foods automatically get added into our kitchen inventory.  \n  \nIdeally, these automations can be created in Taskade or some other ai based system that I can monitor, edit, and track.",
    "duration": "1 to 3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Taskade Expert to Automate",
    "client_infomation": "United States Seattle 1:17 AM 12 jobs posted 67% hire rate, 1 open job $3.2K total spent 8 hires, 5 active $6.18 /hr avg hourly rate paid 291 hours Health & Fitness Individual client Member since Feb 3, 2024",
    "url": "https://www.upwork.com/jobs/Taskade-Expert-Automate_~021877091982960036798/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877091982960036798/apply/",
    "upwork_id": "021877091982960036798",
    "rate": "Less than 30 hrs/week",
    "job_id": "021877091982960036798",
    "score": 7.0
  },
  "021876692704026365332": {
    "description": "We are seeking a highly skilled, self-motivated, and proactive Executive Assistant & Business Operations Specialist to support a C-level executive in managing both business and personal affairs. This role is tailor-made for a workaholic who thrives on achieving results, loves tackling challenges head-on, and takes pride in getting things done efficiently and effectively. If you’re an overachiever who excels in fast-paced environments, is a natural problem solver, and can learn new technologies at lightning speed, this is the perfect opportunity for you. Practically, we’re looking for a rock star who can hit the ground running and make an immediate impact.  \n  \nKey Responsibilities:  \n  \nManage and optimize the executive’s calendar, including scheduling meetings, appointments, and travel arrangements.  \n  \nOversee and organize the executive’s email inbox, ensuring timely responses and prioritization of critical communications.  \n  \nAct as a trusted liaison between the executive and internal/external stakeholders.  \n  \nLeverage technical expertise to automate workflows, optimize processes, and implement AI-driven solutions.  \n  \nManage and oversee complex projects from inception to completion, ensuring timely delivery and high-quality results.  \n  \nConduct research, analyze data, and prepare reports or presentations to support decision-making.  \n  \nHandle personal tasks and errands with discretion and efficiency.  \n  \nStay ahead of emerging technologies and tools to enhance productivity and innovation.  \n  \nQualifications:  \n  \n7+ years of experience as a software developer, coder, or in a similar technical role.  \n  \nProven expertise in AI, automation, and project management.  \n  \nExceptional verbal and written communication skills.  \n  \nStrong problem-solving abilities and a proactive, self-sufficient mindset.  \n  \nHigh level of discretion and professionalism when handling confidential information.  \n  \nPassion for technology and a willingness to continuously learn and adapt.  \n  \nExperience working with high-level executives or in a similar support role is a plus.  \n  \nPersonal Attributes:  \n  \nA true workaholic who loves staying busy and achieving goals.  \n  \nAn overachiever who goes above and beyond to deliver exceptional results.  \n  \nA quick learner who can master new tools, software, or AI technologies almost instantly.  \n  \nA natural problem solver who thrives under pressure and thinks on their feet.  \n  \nSelf-motivated, independent, and resourceful.  \n  \nCaring, empathetic, and able to build strong relationships.  \n  \nHighly organized with an eye for detail.  \n  \nThrives under pressure and can manage multiple priorities effectively.  \n  \nPrivate and respectful of confidentiality.  \n  \nWork Hours: Must be available to work full time during Eastern Standard Time (EST) business hours.  \n  \nWhy Join Us:  \nThis is a unique opportunity to work closely with a successful C-level executive and make a significant impact on both their professional and personal life. You’ll have the freedom to innovate, implement cutting-edge solutions, and take ownership of projects that drive success. If you’re someone who loves a challenge, thrives on productivity, and is always looking for ways to overdeliver, this role is for you. We’re looking for a rock star who can adapt quickly, solve problems creatively, and stay ahead of the curve in an ever-evolving tech landscape.  \n  \nHow to Apply:  \nIf you meet the qualifications and are excited about this opportunity, please submit the following:  \n  \nYour resume.  \n  \nA cover letter detailing your relevant experience and why you’re the ideal candidate for this role.  \n  \nA three-minute (maximum) video of yourself answering the following questions:  \n  \nWhy are you interested in this position?  \n  \nWhat is your ideal work environment?  \n  \nWhat are your strengths?  \n  \nTell me about a time when you had to comply with a policy you didn’t agree with.  \n  \nWhere do you see yourself in five years?  \n  \nPlease upload your resume, cover letter, and video to Upwork. Applications without a video submission will not be considered.",
    "duration": "6+ months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Executive Assistant & Business Operations Specialist (Tech-Savvy, AI-Driven, Project Man. Expert)",
    "client_infomation": "United States Brooklyn 6:18 AM 148 jobs posted 45% hire rate, 6 open jobs $220K total spent 81 hires, 24 active $5.31 /hr avg hourly rate paid 32,265 hours Member since Apr 19, 2016",
    "url": "https://www.upwork.com/jobs/Executive-Assistant-Business-Operations-Specialist-Tech-Savvy-Driven-Project-Man-Expert_~021876692704026365332/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876692704026365332/apply/",
    "upwork_id": "021876692704026365332",
    "rate": "$10.00 - $22.00",
    "job_id": "021876692704026365332",
    "score": 7.0
  },
  "021876659550716628372": {
    "description": "Looking for a skilled freelancer to develop an AI-powered real estate proposal generator. This tool should efficiently extract relevant values from property reports a upload the values to a pre-defined proposal template. Additionally, it will need to generate maps, highlight local businesses, and provide pertinent statistics. The ideal candidate should have experience in AI,  data extraction and migration. Your expertise will help streamline our proposal process and enhance client presentations.  \n  \nTools:  \n  \nOur presentation builder is canva - this tool will need to upload values automatically using their API or similar method.  \n  \nI would like a place to check the extracted values from the property report and make edits/corrections before it generates the proposal.  \n  \nLastly, this system should be replicable so multiple people can use it.  \n  \nWould prefer to use low/no-code tools if possible",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "AI-Based Real Estate Proposal Generator Needed",
    "client_infomation": "United States Indianapolis 4:18 AM 2 jobs posted 0% hire rate, 2 open jobs Tech & IT Individual client Member since Jan 7, 2025",
    "url": "https://www.upwork.com/jobs/Based-Real-Estate-Proposal-Generator-Needed_~021876659550716628372/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876659550716628372/apply/",
    "upwork_id": "021876659550716628372",
    "rate": "$500.00",
    "job_id": "021876659550716628372",
    "score": 8.0
  },
  "021876225416715233166": {
    "description": "We are an AI Infra startup, in the same space as OpenRouter, RunPod, Langchain. We are looking for AI Engineers cum Marketers who can help us spread the word around.  \n  \nBecause we work in a very technical domain, we specifically need marketers who can understand the work that we do. If you haven't heard of OpenRouter, RunPod, Langchain - then this opportunity is probably not for you.  \n  \nYou will need to spend sometime understanding our product and then creating content to market on different social media. We will be able to help with ideas and material on the kind of posts that can be made. The key competency that we are looking at is ability to understand the start of the art in AI, put our work in perspective and use that to create social media content.  \n  \nBefore you apply, please consider answering the following questions, to help\nus understand your suitability for the role.  \n  \n1. What is your source of learning about the latest in AI ?  \n2. Have you ever used an open source AI model ? And on which platform ?  \n3. Name the chinese AI model which has been in the news lately.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Reddit/Twitter Marketing for AI Startup",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Reddit-Twitter-Marketing-for-Startup_~021876225416715233166/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876225416715233166/apply/",
    "upwork_id": "021876225416715233166",
    "rate": "$5.00 - $30.00",
    "job_id": "021876225416715233166",
    "score": 6.0
  },
  "021876157695704036995": {
    "description": "We are looking for an experienced AI Image Specialist with deep knowledge of\ntools like Stable Diffusion, MidJourney, and similar platforms. The goal of\nthe project is to develop a custom AI model tailored specifically for\ngenerating NSFW content with high quality and creative control.\n\nThe ideal candidate should have the expertise to train and fine-tune their own\nmodel to deliver exceptional results while meeting our specific requirements.\nImportant: Only if you have done it before!",
    "duration": "One-time project",
    "experience_level": "Expert",
    "job_type": "Fixed",
    "title": "AI Image Specialist for NSFW Content Creation",
    "client_infomation": "nan",
    "url": "https://www.upwork.com/jobs/Image-Specialist-for-NSFW-Content-Creation_~021876157695704036995/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876157695704036995/apply/",
    "upwork_id": "021876157695704036995",
    "rate": "$800.00",
    "job_id": "021876157695704036995",
    "score": 5.0
  },
  "021876065416033203843": {
    "description": "I need help using AI/automation to create our monthly eCommerce SEO newsletter each month.  Here are some examples of how the newsletter should look:  - <https://www.180marketing.com/this-month-in-ecommerce-seo-may-2024/>  - <https://www.180marketing.com/this-month-in-ecommerce-seo-june-2024/>  - <https://www.180marketing.com/this-month-in-ecommerce-seo-july-2024/>    Here's the process we've been doing manually so far:    Step 1 - Find recently published articles to feature in the newsletter that would appeal to eCommerce store owners who are interested/curious about SEO. Here's a list of approved sources to pull articles from:  <https://sparktoro.com/blog/> <https://detailed.com/latest/> <https://zyppy.com/seo/> <https://www.growth-memo.com/archive> <https://ipullrank.com/blog> <https://www.semrush.com/blog/> <https://ahrefs.com/blog/> <https://searchengineland.com/library/seo> <https://www.seroundtable.com/category/google> <https://www.searchenginejournal.com/category/seo/> <https://brodieclark.com/notes/>    Step 2 - Write a 1 paragraph summary with 2-4 sentences for each for each article.    Step 3 - Write 3-5 bullet points detailing the key takeaways from each article, and why an eCommerce store owner should care.    Step 4 - Write a unique \"SEO Tip of the Month\" to feature at the beginning of the newsletter that is helpful and actionable.    Step 5 - Publish to Wordpress    ### Expectations ###    I'm hoping to automate as much or all of this process as possible, while generating outputs that are very close to the previous newsletter examples:  - <https://www.180marketing.com/this-month-in-ecommerce-seo-may-2024/>  - <https://www.180marketing.com/this-month-in-ecommerce-seo-june-2024/>  - <https://www.180marketing.com/this-month-in-ecommerce-seo-july-2024/>    I will be testing the automation for December 2024 to assess the quality of the newsletter. There's a few things I will be looking for.  1. How appealing are the selected articles for an eCommerce store owner?  2. How well written are the article summaries?  3. How insightful are the article takeaways?  4. Does the style and tone match the newsletter examples provided?",
    "duration": "1 to 3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Use AI/Automation to create a monthly newsletter",
    "client_infomation": "United States | San Diego | 52 jobs posted | 99% hire rate, 1 open job | $26K total spent | 57 hires, 15 active | $14.34 /hr avg hourly rate paid | 1,113 hours | Sales & Marketing | Mid-sized company (10-99 people) | Member since Dec 26, 2011",
    "url": "https://www.upwork.com/jobs/Use-Automation-create-monthly-newsletter_~021876065416033203843/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021876065416033203843/apply/",
    "upwork_id": "021876065416033203843",
    "rate": "Less than 30 hrs/week",
    "job_id": "021876065416033203843",
    "score": 9.0
  },
  "021877120210093280190": {
    "description": "We are seeking an experienced developer to create an AI as a Service platform that integrates a Large Language Model (LLM) with real-time sales data from various retailers. The ideal candidate will have a strong background in AI development and API integration, with the ability to design scalable solutions. You will be responsible for ensuring seamless data flow and model performance, providing insights to enhance sales strategies. If you are passionate about leveraging AI to drive business results, we would love to hear from you.",
    "duration": "3 to 6 months 3-6 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "AI as a Service Platform Development for LLM Integration",
    "client_infomation": "nan",
    "rate": "$25.00-$47.00 Hourly",
    "url": "https://www.upwork.com/jobs/Service-Platform-Development-for-LLM-Integration_~021877120210093280190/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877120210093280190/apply/",
    "upwork_id": "021877120210093280190",
    "job_id": "021877120210093280190",
    "score": 6.0
  }
}