{
  "021877214995244190654": {
    "description": "We are seeking a skilled Automation Engineer to help develop a solution for automating data entry and form autofill workflows for custom use cases. The project involves creating scripts to input user-provided data into various online forms, ensuring accuracy, efficiency, and seamless operation.  \n  \nProject Scope  \nThe project will focus on creating a robust and flexible automation tool for streamlining data entry tasks. The tool will:  \n  \nRetrieve structured data (e.g., user information, text inputs, file uploads) from a database or API.  \nAutofill and submit the data into specific online forms or systems.  \nImplement techniques to ensure compatibility and reliability across multiple platforms.  \nKey Deliverables  \nCustom Form Autofill Tool:  \n  \nCreate scripts to autofill and submit data into online forms, tailored for each platform.  \nHandle dynamic fields, dropdown menus, file uploads, and multi-step forms.  \nError Handling and Reporting:  \n  \nImplement error detection to identify issues like failed submissions or incorrect data formats.  \nProvide detailed logs to monitor script performance and identify errors.  \nScalable Architecture:  \n  \nDesign a solution that can handle varying volumes of data entry tasks efficiently.  \nEnsure compatibility with different platforms and form structures.  \nPerformance Optimization:  \n  \nMinimize input errors and submission failures.  \nOptimize execution speed while maintaining data accuracy.  \nRequirements  \nTechnical Skills:  \n  \nProficiency in Python or other relevant programming languages.  \nExperience with web automation frameworks like Selenium.  \nAbility to work with APIs, databases, and data manipulation tools.  \nExperience:  \n  \nProven track record of developing automation tools for data entry or form submissions.  \nKnowledge of handling multi-step forms and dynamic fields.  \nProblem-Solving:  \n  \nAbility to troubleshoot and resolve issues with compatibility, form structures, or data mismatches.  \nExperience optimizing workflows for efficiency and reliability.  \nAdditional Information  \nData Source: The data to be entered will be provided via API or other structured formats.  \nTarget Platforms: A list of platforms will be provided, and scripts must be tailored to handle their unique requirements.  \nError Logs: Detailed reporting is essential to monitor performance and troubleshoot issues effectively.  \nThis project is ideal for automation engineers who enjoy creating efficient, reliable tools that simplify repetitive workflows. If you’re interested, please share your experience, examples of similar work, and your proposed approach to building these automation scripts.",
    "duration": "1 to 3 months 1-3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Automation Engineer for Custom Data Entry and Form Autofill Tools",
    "client_infomation": "United States Austin 1:29 AM 209 jobs posted 59% hire rate, 1 open job $96K total spent 201 hires, 27 active $6.44 /hr avg hourly rate paid 8,851 hours HR & Business Services Small company (2-9 people) Member since Mar 30, 2019",
    "rate": "$20.00 - $50.00",
    "url": "https://www.upwork.com/jobs/Automation-Engineer-for-Custom-Data-Entry-and-Form-Autofill-Tools_~021877214995244190654/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877214995244190654/apply/",
    "upwork_id": "021877214995244190654",
    "job_id": "021877214995244190654",
    "score": 9.0
  },
  "021877186881994689470": {
    "description": "VIRTUAL ASSISTANT NEEDED WITH SPECIALIST SKILLS IN LEAD GENERATION! SHORT TERM PROJECT WITH POTENTIAL FOR LONG TERM WORK OR FULL TIME ROLE FOR THE RIGHT CANDIDATE  \n  \nWe're on the look out for a virtual assistant to assist in lead generation activities for our company  \n  \nWe are a doors, timber & hardware supply & installation company, working within the residential new home construction industry in Sydney Australia.  \n  \nWe are looking to reach out to new potential clients that fit our ideal avatar profile, which is project home & residential home builders across Sydney.  \n  \nWe are looking for somebody who can provide us with a more detailed version of a data scrape on builders that fit our avatar, so that we have some good in depth knowledge on the company, the key points of contact within the company & some info about previous projects that we may be able to use during our outreaches.  \n  \nYour duties would include:  \n  \n\\- compiling a list of contacts via google search, linkedin, instagram & any other sources that you may find of clients that suit our avatar  \n\\- research the companies to find contact details, office locations, key points of contact details/emails/phone numbers & find information on previous projects they may have completed  \n\\- create profiles in our client database (we use Asana to keep this information) & update them to suit  \n\\- Assist in nurturing these leads as we reach out to them & keeping them up to date in our CRM  \n  \nIdeally, you would have a good knowledge & experience in:  \n  \n\\- Company/profile research  \n\\- Use of Asana software for task management  \n\\- Data management  \n\\- Communication tools such as WhatsApp  \n  \nPlease note that we would require that you have a good level of reading, writing & communication in English for this role.  \n  \nWe have a permanent role available for the right candidate for future administration tasks within the company also!  \n  \nPlease reach out &  I would love to connect, thanks!",
    "duration": "Less than 1 month",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Virtual Assistant - Lead Generation/Data Compilation",
    "client_infomation": "Australia 6:30 PM 3 jobs posted 0% hire rate, 1 open job Member since Jan 18, 2022",
    "rate": "$5.00 - $10.00",
    "url": "https://www.upwork.com/jobs/Virtual-Assistant-Lead-Generation-Data-Compilation_~021877186881994689470/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877186881994689470/apply/",
    "upwork_id": "021877186881994689470",
    "job_id": "021877186881994689470",
    "score": 2.0
  },
  "021877185543940208259": {
    "description": "Looking for a developer to create 4 AI agents that can perform a string of basic tasks including internet searching, reading web pages, identification, and making API calls to record data. The ideal candidate should have experience in AI programming and web automation. The project requires a clear understanding of how to collect and process information from the internet effectively and efficiently.  Multiple long term opportunities available depending on work quality, speed, and communication.  \n  \nRequirements  \n- 4 Similar Scope AI Agents  \n- The agent should be packaged up in a docker compose so that it is easily deployable on our servers  \n- The agent should have detailed runtime logs",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "AI Agent Development for Basic Task Automation | Long Term Position Available",
    "client_infomation": "USA Austin 1:30 AM 13 jobs posted 62% hire rate, 2 open jobs $12K total spent 11 hires, 8 active Tech & IT Small company (2-9 people) Member since Aug 4, 2024",
    "rate": "$650.00",
    "url": "https://www.upwork.com/jobs/Agent-Development-for-Basic-Task-Automation-Long-Term-Position-Available_~021877185543940208259/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877185543940208259/apply/",
    "upwork_id": "021877185543940208259",
    "job_id": "021877185543940208259",
    "score": 8.0
  },
  "021877157270493531541": {
    "description": "We are looking for a skilled Project Consultant to assist in defining, analysing, and documenting the requirements for our online education platform, which is currently in the development phase. This role combines aspects of project management, business analysis, and technical writing to ensure the successful delivery of a comprehensive requirements document for our development team.  Key Responsibilities:  1) Collaborate with the project owner to gather and understand project goals, user needs, and technical requirements.  2) Facilitate a detailed discovery session via video call to outline functional and non-functional requirements.  3)Document clear and structured Software Requirements Specifications (SRS) and related project documents.  4) Act as a liaison between stakeholders and the development team to ensure clarity and alignment of project objectives.  5) Provide input on project management and help define timelines, milestones, and deliverables.  6) Revise and finalize the requirements documentation based on feedback and additional insights.  Qualifications:  Experience in business analysis, project management, and/or technical writing.  Proven ability to gather and document functional and non-functional requirements.  Familiarity with online education platforms or similar systems is a plus.  Strong communication, organizational, and stakeholder management skills.  Knowledge of industry standards for requirements documentation and project workflows.  How to Apply:  If you have experience in project management, business analysis, and requirements writing, please apply with examples of your previous work and your availability for a video call.  We look forward to working with a professional who can help us shape the future of our platform!",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Project Consultant – Business Analysis and Requirements Documentation",
    "client_infomation": "Payment method verified. Phone number verified. Rating is 0 out of 5. 0.00 of 0 reviews. Pakistan. Karachi 12:30 PM. 5 jobs posted. 20% hire rate, 1 open job. $5 total spent. 1 hire, 1 active. Education. Small company (2-9 people). Member since May 30, 2024",
    "rate": "nan",
    "url": "https://www.upwork.com/jobs/Project-Consultant-Business-Analysis-and-Requirements-Documentation_~021877157270493531541/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877157270493531541/apply/",
    "upwork_id": "021877157270493531541",
    "job_id": "021877157270493531541",
    "score": 3.0
  },
  "021877067559804466819": {
    "description": "Discord Bot for Monitoring Pokémon Card Restocks 1. Project Objective I am looking for a developer to create a Discord bot that monitors a specific website for Pokémon card restocks. When the bot detects that items are back in stock, it should send a notification to a designated Discord channel. 2. Bot Features Website Monitoring: URL: [Insert the website URL]. Monitor specific elements on the website indicating stock availability (e.g., \"In Stock,\" \"Out of Stock\"). Discord Notifications: The notification should include: Product name. Price (if available). A link to the product. Notifications should be sent to a specific channel (provide the channel ID or name). Regular Monitoring: The bot should check the website every [e.g., 60 seconds]. Proxy Support (if needed): If the website blocks automated requests, the bot should support proxy usage or similar solutions. 3. Requirements Programming language: Preferably Python (but other options are acceptable). Documentation: Provide basic setup and usage instructions for the bot. Flexibility: The bot should allow future additions of more websites to monitor. 4. Additional Information Deadline: [Specify your desired timeline, e.g., 1-2 weeks]. Budget: [Specify your budget range, e.g., €100–300 for a basic bot]. Communication: English communication is fine for the project. 5. How to Apply Please include the following in your application: Examples of similar projects you have worked on (if available). Your proposed price and estimated time for completion.",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Discord Bot Developer Needed: Monitor Website for Pokémon Card Restocks",
    "client_infomation": "nan",
    "rate": "$100.00",
    "url": "https://www.upwork.com/jobs/Discord-Bot-Developer-Needed-Monitor-Website-for-Pok-mon-Card-Restocks_~021877067559804466819/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877067559804466819/apply/",
    "upwork_id": "021877067559804466819",
    "job_id": "021877067559804466819",
    "score": 7.0
  },
  "021877049459176574356": {
    "description": "We are seeking experienced developers to create automated web scraping agents capable of collecting, organizing, and delivering real-time data from multiple online platforms. These agents should handle dynamic content, integrate with APIs where available, and operate on a set schedule with minimal manual oversight.  The objective is to develop a robust system that scrapes various websites for specific data fields, ensuring that the extracted data is accurate and well- structured. The solution should include features such as error handling, logging, proxy management, and potential CAPTCHA bypass to maintain smooth operation.  Requirements: 1. Platforms to Scrape: • Reddit (targeted subreddits) • Yahoo Finance forums • Public online forums and discussion sites (specific ones to be discussed upon hiring) 2. Data to Extract: • Post titles • Comments and replies • User interactions (upvotes, replies, timestamps) • Relevant metadata from discussions 3. Automation Features: • Schedule-based execution (e.g., hourly or daily runs) • Error handling and automatic retries with logging • Proxy support and CAPTCHA bypass where needed 4. Output Requirements: • Export structured data in formats such as CSV or JSON • Clear documentation for running, maintaining, and updating the agents 5. Technical Skills Required: • Proficiency in web scraping using tools like Scrapy, BeautifulSoup, Selenium, or Puppeteer • Experience handling dynamic websites and anti-bot mechanisms • Familiarity with API-based data extraction where available • Strong Python skills or similar scripting languages • Solid understanding of data organization and export protocols  We’re looking for candidates who can deliver efficient, well-documented solutions with a strong focus on reliability and accuracy. Clear communication and timely progress updates are also important.  If you have worked on similar projects before, please include examples of your previous work, the tools you used, and any unique challenges you faced.",
    "duration": "1 to 3 months",
    "experience_level": "Expert",
    "job_type": "Hourly",
    "title": "Web Scraping Agents Needed for Multi-Platform Data Extraction",
    "client_infomation": "United States | 393 jobs posted | $25K total spent | Member since Jun 8, 2012 | Rating is 4.8 out of 5.",
    "rate": "$15.00 - $25.00",
    "url": "https://www.upwork.com/jobs/Web-Scraping-Agents-Needed-for-Multi-Platform-Data-Extraction_~021877049459176574356/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877049459176574356/apply/",
    "upwork_id": "021877049459176574356",
    "job_id": "021877049459176574356",
    "score": 7.0
  },
  "021877042536184149635": {
    "description": "Improve the scrapping script and deploy in aws: experience with playwright, S3, SQS, AWS, python.",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Improve Scrapping Python and Deploy in AWS",
    "client_infomation": "nan",
    "rate": "$30.00",
    "url": "https://www.upwork.com/jobs/Improve-Scrapping-Python-and-Deploy-AWS_~021877042536184149635/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877042536184149635/apply/",
    "upwork_id": "021877042536184149635",
    "job_id": "021877042536184149635",
    "score": 8.0
  },
  "021877040154035932526": {
    "description": "Make.com scenario build that scrapes individual listings from a FindLaw.com search results page and returns the required data from each listing in a organized/structured format",
    "duration": "Ongoing project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Make.com Web Scrapper Scenario build",
    "client_infomation": "nan",
    "rate": "$500.00",
    "url": "https://www.upwork.com/jobs/Make-com-Web-Scrapper-Scenario-build_~021877040154035932526/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877040154035932526/apply/",
    "upwork_id": "021877040154035932526",
    "job_id": "021877040154035932526",
    "score": 6.0
  },
  "021877035520946468483": {
    "description": "We welcome the natives of Bulgaria to help us in completion of our project.  We are currently looking to recruit highly-professional, client focused interviewers to work on a variety of projects. Work can be done remotely from Bulgaria as a research Analyst from BRG/ IAL. Focus is to successfully complete Primary research.  \n  \nSkills Required  \n- Successful candidates must speak Bulgarian , and should also be able to communicate effectively in English.  \n-Should be dedicated and result oriented",
    "duration": "Less than 1 month",
    "experience_level": "Intermediate",
    "job_type": "Hourly",
    "title": "Market Researcher -Bulgaria",
    "client_infomation": "nan",
    "rate": "$9.00/hr",
    "url": "https://www.upwork.com/jobs/Market-Researcher-Bulgaria_~021877035520946468483/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877035520946468483/apply/",
    "upwork_id": "021877035520946468483",
    "job_id": "021877035520946468483",
    "score": 1.0
  },
  "021877016448964242260": {
    "description": "I need a tool that monitors this website: <https://www.solanaaihackathon.com/projects>  If there is a new project listed, i should get a notification my discord and the project details ( Project Name + Twitter url + webiste) should be saved in a google sheet.  This should happen in real time.  Experienced scrapers only",
    "duration": "One-time project",
    "experience_level": "Intermediate",
    "job_type": "Fixed",
    "title": "Get notification if website lists a new project",
    "client_infomation": "nan",
    "rate": "$80.00",
    "url": "https://www.upwork.com/jobs/Get-notification-website-lists-new-project_~021877016448964242260/?referrer_url_path=/nx/search/jobs",
    "apply_url": "https://www.upwork.com/nx/proposals/job/~021877016448964242260/apply/",
    "upwork_id": "021877016448964242260",
    "job_id": "021877016448964242260",
    "score": 8.0
  }
}